{
  "full_text": "Indias Sustainability Architecture 2026: A Comprehensive Assessment of Government Schemes for Green Growth, Skilling, and Ecological Restoration Executive Summary The fiscal year 2026 represents a watershed moment in the economic and ecological history of India. Following the foundational commitments made at COP26 in Glasgow and the subsequent enhancement of Nationally Determined Contributions (NDCs), the Government of India has systematically re-engineered its policy framework to align economic development with climate resilience. This report provides an exhaustive, expert-level analysis of the active government schemes in India as of 2026, encompassing the interlocking domains of sustainability, green skills, general workforce development, afforestation, and green entrepreneurship. Our analysis reveals a paradigm shift in governance strategy: a transition from fragmented, input-based subsidies to integrated, outcome-based incentive structures. The policy landscape of 2026 is characterized by the convergence of energy security, livelihood generation, and ecological stewardship. Key flagships such as the National Green Hydrogen Mission and PM-KUSUM have been capitalized with substantial outlays to drive the installation of 500 GW of non-fossil fuel capacity by 2030. Simultaneously, the rural economy is being reimagined through schemes like PM-PRANAM and GOBARdhan, which utilize fiscal federalism to reduce chemical dependency and monetize organic waste, thereby creating a circular bio-economy. In the domain of human capital, the demographic dividend is being leveraged through the active implementation of PMKVY 4.0 and the strategic rollout of PMKVY 5.0. These initiatives mark a decisive pivot toward Green Jobs, institutionalized by the Skill Council for Green Jobs (SCGJ), ensuring that the workforce transition keeps pace with the industrial transition. Furthermore, the operationalization of market-based instrumentsspecifically the Green Credit Programme (GCP) and the Carbon Credit Trading Scheme (CCTS)signals the maturity of Indias environmental policy, moving beyond command-and-control regulation to sophisticated market mechanisms that price externalities. This report synthesizes data from active guidelines, ministry notifications, and implementation frameworks active in 2026. It offers a granular examination of scheme mechanics, funding patterns, eligibility criteria, and the broader strategic implications of Indias green transition. 1. The Energy Transition: Strategic Missions and Renewable Infrastructure The energy sector remains the fulcrum of Indias sustainability strategy. By 2026, the focus has broadened from simple capacity addition to the creation of resilient value chains, indigenous manufacturing capabilities, and the decarbonization of hard-to-abate heavy industries. 1.1 National Green Hydrogen Mission (NGHM) The National Green Hydrogen Mission, launched with an initial outlay of 19,744 crore, has entered its most critical execution phase in 2026.1 Having established the policy groundwork, the mission is now actively funding pilot projects and disbursing incentives to establish India as a global hub for the production, usage, and export of green hydrogen and its derivatives. 1.1.1 Mission Architecture and 2030 Targets The mission is anchored by the ambition to achieve a green hydrogen production capacity of at least 5 Million Metric Tonnes (MMT) per annum by 2030. This production target is supported by a requisite renewable energy capacity addition of approximately 125 GW, specifically dedicated to powering electrolysers.2 The economic logic of the mission is predicated on two outcomes: import substitution and export leadership. By displacing fossil fuel imports, the mission aims to save 1 lakh crore annually while attracting cumulative investments totaling 8 lakh crore.2 In 2026, the missions overarching objective is explicitly defined: to make India Aatmanirbhar (self-reliant) in clean energy and to serve as an inspiration for the global clean energy transition.1 This geopolitical dimension is critical, as it positions India not just as a consumer of green technology, but as a primary producer and exporter. 1.1.2 Pilot Project Implementation and Funding To bridge the gap between laboratory success and commercial viability, the mission has allocated specific outlays for pilot projects in three strategic sectors. These pilots are designed to validate technical feasibility and establish safety standards.  Low Carbon Steel Projects (455 Crore): Active up to FY 2029-30, this window supports the steel industrys transition from coking coal to green hydrogen. Steel production is a major carbon emitter, and replacing carbon with hydrogen as a reducing agent in Direct Reduced Iron (DRI) furnaces is a technological frontier this scheme seeks to breach.1 The extended timeline reflects the capital-intensive nature of steel plant retrofitting.  Mobility Pilot Projects (496 Crore): Active until 2025-26, this funding targets the heavy-duty transport segment. While battery electric vehicles (BEVs) dominate personal mobility, hydrogen fuel cells are viewed as the optimal solution for long-haul trucking and inter-city buses due to their higher energy density and faster refueling times.1  Shipping Pilot Projects (115 Crore): Active until 2025-26, this component addresses the decarbonization of the maritime sector. Initiatives include the development of green ammonia bunkers at major ports and the retrofitting of vessels to run on green methanol or hydrogen.1 The mission also retains flexibility to fund pilots in decentralized energy applications, hydrogen production from biomass, and hydrogen storage technologies, acknowledging that the optimal use-cases for hydrogen may evolve.1 1.1.3 Strategic Interventions for Green Hydrogen Transition (SIGHT) The financial engine of the mission is the SIGHT programme, which commands the bulk of the outlay (17,490 crore).3 SIGHT is structured as a Production Linked Incentive (PLI) mechanism with two distinct components: 1. Component I: Electrolyser Manufacturing: To reduce the capital cost of green hydrogen, India must manufacture electrolysers domestically. This component offers incentives per kilowatt of manufacturing capacity. By 2026, Tranche-II of this scheme is active, supporting the scale-up of gigafactories for Alkaline, PEM, and Solid Oxide technologies. 2. Component II: Green Hydrogen Production: This component provides a direct subsidy per kilogram of green hydrogen produced. The incentive is designed to bridge the viability gap between grey hydrogen (produced from natural gas) and green hydrogen. The subsidy tapers down over a three-year period, forcing producers to achieve efficiency gains and cost reductions over time.3 1.1.4 Research and Development: The Horizon 2030 To prevent technological dependency, the mission aggressively funds RD. The strategy distinguishes between incremental innovation for immediate deployment and Blue Sky Projects with a 0-15 year horizon.3  Focus Areas: Development of efficient, low-cost electrolysers, Type-IV storage cylinders, and next-generation fuel cells.  Active Calls: The Biotechnology Industry Research Assistance Council (BIRAC) has active calls for proposals until January 27, 2026, specifically targeting biomass-based hydrogen production technologies at Technology Readiness Levels (TRL) 56.4 This focus on biomass leverages Indias agrarian economy to produce bio-hydrogen, creating a unique value proposition compared to solar-based hydrogen. 1.2 Pradhan Mantri Kisan Urja Suraksha evam Utthaan Mahabhiyan (PM-KUSUM) The PM-KUSUM scheme, extended until March 31, 2026, represents one of the most significant interventions in the rural energy landscape.5 It addresses the Water-Energy-Food Nexus by solarizing agricultural power consumption, thereby reducing the subsidy burden on State DISCOMs and providing reliable daytime power to farmers. 1.2.1 Component Architecture and Strategic Targets The scheme envisions adding a total solar capacity of 34,800 MW by March 2026, supported by Central Financial Support of 34,422 crore.5 The architecture comprises three interlinked components: Component Target Description Strategic Rationale Component A 10,000 MW of Decentralized GroundStilt Mounted Solar Plants Allows farmers to become energy producers (Annadata to Urjadata) by leasing barren lands for solar plants (up to 2 MW). Component B 14 Lakh Stand-alone Solar Agriculture Pumps Targets off-grid areas where grid extension is prohibitively expensive, replacing diesel pumps and reducing carbon emissions. Component C Solarization of 15 Lakh Grid-connected Pumps Reduces the agricultural subsidy burden for DISCOMs by allowing farmers to generate their own power and sell surplus to the grid. 1.2.2 Key Operational Amendments for 2026 To accelerate adoption and overcome implementation hurdles, the Ministry of New and Renewable Energy (MNRE) has introduced several critical amendments active in 2026: 1. Feeder Level Solarization (FLS): Under Component C, the focus has shifted from solarizing individual pumps to solarizing entire agricultural feeders. This creates a virtual solar power plant at the substation level. It simplifies metering, billing, and grid management for DISCOMs while ensuring that all pumps on a feeder receive solar power.7 2. Land Use Flexibility: Recognizing the scarcity of purely barren land, the guidelines now permit the installation of solar plants on pasturelands and marshlands, provided the primary ecological function is not compromised. This is particularly relevant for states with high wetland density.7 3. Waiver of Domestic Content Requirement (DCR): A major bottleneck has been the shortage of domestically manufactured solar cells. To unblock projects, the DCR mandate was waived for feeder-level solarization projects awarded on or before June 20, 2023. This waiver continues to facilitate project execution in 2026.8 4. Removal of Generation Penalties: The penalty on solar power generators for shortfall in generation under Component A has been removed. This significantly de-risks the investment for farmers and developers who previously faced fines for weather-related generation dips.7 1.2.3 Financial Assistance and Regional Variations  Standard CFA: The Central Financial Assistance (CFA) is typically capped at 30 of the benchmark cost or the tender cost, whichever is lower.  Special Category States: For North-Eastern States, JK, Ladakh, Himachal Pradesh, and Uttarakhand, the CFA is higher. Furthermore, for these regions, CFA is available for pump capacities up to 15 HP (compared to the standard 7.5 HP cap) to account for the higher lift requirements in hilly terrain.8  Inter-Component Flexibility: States are permitted to transfer physical targets between Component B and Component C based on local demand, ensuring that the overall capacity target of 34,800 MW is met efficiently.6 1.3 Production Linked Incentive (PLI) for Solar PV Modules While primarily an industrial policy, the PLI Scheme for High Efficiency Solar PV Modules is the supply-side counterpart to PM-KUSUM and the Rooftop Solar programme.  Tranche II Status: With an outlay of 14,007 crore, Tranche II allocated 39,600 MW of manufacturing capacity.  2026 Milestone: The scheme mandates that the final block of capacity (approximately 15,400 MW) must become operational by April 2026.9 This ensures that as demand peaks under PM-KUSUM and the Green Hydrogen Mission, a robust domestic supply chain of high-efficiency modules is available to meet it. 2. The Bio-Economy: Waste-to-Wealth and Sustainable Agriculture Indias strategy for the rural economy in 2026 is defined by circularity. Schemes are designed to close the loopturning agricultural waste into energy and returning nutrients to the soil. 2.1 GOBARdhan (Galvanizing Organic Bio-Agro Resources Dhan) The GOBARdhan initiative is a Whole of Government approach to converting organic waste (cattle dung, agri-residue) into biogas, Compressed Biogas (CBG), and Bio-CNG. It operates under the umbrella of the Swachh Bharat Mission (Grameen) Phase II.10 2.1.1 Implementation Framework (2020-2026) The scheme is operational through FY 2025-26 with the following key provisions:  Cluster Model: It supports the setting up of community and cluster-based biogas plants.  Financial Assistance: A specialized grant of up to 50 lakhs per district is available to catalyze local projects.10  Unified Registration Portal: This portal acts as the single window for registration, a mandatory step to access benefits across converging ministries (MNRE, MoPNG, Dept of Fertilizers).11 2.1.2 Market Development and Offtake Security The success of GOBARdhan in 2026 is driven by aggressive market creation policies: 1. Mandatory Blending: The government has notified a phase-wise mandatory blending of CBG in the CNG (transport) and PNG (domestic) segments. This creates a guaranteed demand sink for producers, de-risking their capital investment.11 2. Excise Exemptions: To ensure price competitiveness against fossil gas, central excise duty exemptions have been extended to CNG blended with CBG.11 3. Pipeline Infrastructure (DPI) Scheme: Launched to address logistics, the Development of Pipeline Infrastructure (DPI) scheme funds the construction of pipelines connecting CBG plants to the nearest City Gas Distribution (CGD) network. Revised guidelines in August 2025 streamlined the injection standards, facilitating seamless grid integration.12 4. Biomass Aggregation Machinery (BAM): Financial assistance is provided for procuring the heavy machinery (balers, rakes) required to collect biomass from fields, addressing the critical supply chain bottleneck of feedstock availability.11 2.1.3 Monetization of Bio-Slurry The scheme acknowledges that biogas production generates a nutrient-rich byproduct: bio-slurry.  Fertilizer Control Order (FCO): Fermented Organic Manure (FOM) and Liquid FOM (LFOM) are now recognized fertilizers under the FCO.  Market Development Assistance (MDA): A subsidy of 1,500 per metric tonne is provided for the sale of FOMLFOM. This makes organic manure price-competitive for farmers, simultaneously improving soil health and reducing the import bill for synthetic fertilizers.11 2.2 PM-PRANAM (Restoration, Awareness, Nourishment and Amelioration of Mother Earth) PM-PRANAM represents a novel experiment in fiscal federalism. Rather than a direct subsidy scheme, it is an incentive mechanism designed to nudge states toward balanced fertilizer use.14 2.2.1 The Subsidy Savings Mechanism The scheme does not have a separate budget; it is financed through the savings generated from the reduction in the existing fertilizer subsidy bill.  Baseline Calculation: A states reduction in chemical fertilizer consumption (Urea, DAP, NPK, MOP) is measured against its average consumption over the previous three years.15  Grant Allocation: The Centre passes on 50 of the subsidy savings to the state as a grant.15 For example, if a state saves 3,000 crore in subsidies by reducing consumption, the Centre transfers 1,500 crore back to the state.17  Fund Utilization: The state must utilize the grant in a 70:30 ratio:  70 for asset creation (technological adoption, alternative fertilizer production units).  30 for rewarding farmers, panchayats, and self-help groups (SHGs) who contributed to the reduction.14  Monitoring: The Integrated Fertilizers Management System (iFMS) dashboard tracks consumption data in real-time to calculate eligibility.14 2.3 National Bamboo Mission (NBM) Restructured to treat bamboo as a specialized crop (Green Gold), the mission aims to link farmers to markets. 2.3.1 Funding and 2026 Deliverables  Funding Pattern: 60:40 (Centre:State) for general states, and 90:10 for North Eastern  Hilly states.  2026 Targets: The missions outcome indicators for June 2026 include the establishment of bamboo product trading centres in seven forest zones and a marketing information system to formalize the trade.18 This moves the sector from unorganized artisanal work to a structured agro-industry. 3. Ecological Restoration: Forests, Wetlands, and Carbon Sinks Moving beyond industrial decarbonization, the governments 2026 agenda places heavy emphasis on the restoration of natural ecosystems to act as carbon sinks and biodiversity refuges. 3.1 Nagar Van Yojana (Urban Forest Scheme) As urbanization accelerates, the Nagar Van Yojana aims to create urban lungs within city limits. 3.1.1 Strategic Expansion  Target: The scheme initially targeted 400 Nagar Vans by 2025 but has been expanded to develop 1,000 Nagar Vans by 2027.19  Scope: Projects cover cities with Municipal Corporations, Councils, and ULBs. A typical Nagar Van ranges from 10 hectares to 50 hectares.21 3.1.2 Funding Mechanics via CAMPA The scheme is funded through the National Compensatory Afforestation Fund Management and Planning Authority (CAMPA).  Grant Norms: The Ministry provides a one-time grant of 4 lakh per hectare for fencing, soil conservation, and plantation activities.21  Cap: The maximum grant is capped at 2 crore per Nagar Van.22  Operational Flow: Funds flow from the National Authority to State Forest Development Agencies (SFDAs). The release is typically tranched (e.g., 70 initially), contingent on utilization certificates.22  Components: Beyond trees, the scheme funds biodiversity parks, Smriti Vans (memorial forests), butterfly conservatories, and herbal gardens, turning these forests into centers for environmental education.21 3.2 National Mission for a Green India (GIM) One of the eight missions under the NAPCC, GIM focuses on the quality of forest cover, not just quantity. 3.2.1 Landscape Approach  Objective: To improve foresttree cover on 5 million hectares and improve quality on another 5 million hectares.  Carbon Sink Goal: Sequestering an additional 2.5 to 3.0 billion tonnes of CO2 equivalent by 2030.23  Convergence: GIM relies heavily on convergence with MGNREGS (for labor) and CAMPA (for material) to maximize per-hectare investment. The mission utilizes a bottom-up approach where Joint Forest Management Committees (JFMCs) draft micro-plans.24  Budget: The total estimated cost for the 10-year period (2021-30) is 12,190 crore.23 3.3 MISHTI (Mangrove Initiative for Shoreline Habitats and Tangible Incomes) Launched to protect coastal communities from climate disasters, MISHTI focuses on mangrove reforestation. 3.3.1 Operational Details  Target: Plantation of mangroves over 540 sq. km across 11 States and 2 Union Territories.25  Funding Model: A convergence model where the Centre bears 80 of the cost and State Governments bear 20.25  Tangible Incomes: The scheme explicitly links conservation to livelihoods. It promotes aquaculture (e.g., crab farming) and eco-tourism within mangrove ecosystems to give local communities a financial stake in their protection.26  Status in 2026: States like Gujarat have already planted 190 sq. km, emerging as leaders in implementation.25 3.4 Amrit Dharohar Scheme This scheme targets the conservation of Ramsar Sites (wetlands of international importance). 3.4.1 Duration and Key Pillars  Timeline: The scheme is implemented for three years, concluding in June 2026.27  Pillars: 1. Species Conservation: Developing biodiversity inventories. 2. Nature Tourism: Shifting from mass tourism to high-value nature tourism. Training local youth as nature guides is a core activity.28 3. Wetlands Carbon: Establishing protocols to measure and inventory the carbon stock of wetlands, paving the way for future carbon credit generation from these ecosystems.27 4. Market Mechanisms: Pricing Pollution and Ecology In 2026, Indias environmental policy has matured to include sophisticated market-based instruments. 4.1 Carbon Credit Trading Scheme (CCTS) The CCTS establishes a mandatory domestic carbon market, transitioning from the earlier Perform, Achieve, and Trade (PAT) scheme. 4.1.1 Compliance Mechanism  Obligated Entities: By 2026, the scheme covers 490 entities across hard-to-abate sectors. Initially covering cement, steel, and aluminum, it has expanded to include Textiles, Petroleum Refineries, Petrochemicals, and Secondary Aluminum.29  Targets: Greenhouse Gas Emission Intensity (GEI) targets are notified for compliance years 2025-26 and 2026-27.  Trading: Entities that overachieve their targets earn Carbon Credit Certificates (CCCs). Those who fail must purchase CCCs from the market.  Banking: Unlimited banking of credits is allowed to provide flexibility, but borrowing from future years is prohibited.31  Regulator: The Bureau of Energy Efficiency (BEE) acts as the administrator, while the Central Electricity Regulatory Commission (CERC) regulates the trading on power exchanges.31 4.2 Green Credit Programme (GCP) Distinct from CCTS, the GCP is a voluntary mechanism incentivizing environmentally positive actions. 4.2.1 Voluntary Market Design  Scope: It covers activities like tree plantation, water conservation, sustainable agriculture, and waste management.  Compensatory Afforestation (CA): A critical application in 2026 is the use of Green Credits for CA compliance. Project developers (e.g., highways, mines) can purchase Green Credits generated from afforestation projects to meet their legal obligations for forest diversion. This creates a land bank of degraded forest land available for restoration by private and public entities.32  Administrator: The Indian Council of Forestry Research and Education (ICFRE) manages the Green Credit Registry.34 5. Human Capital: Skilling for the Green Economy A net-zero economy requires a net-zero workforce. The Ministry of Skill Development and Entrepreneurship (MSDE) has aligned its flagship schemes to this reality. 5.1 Pradhan Mantri Kaushal Vikas Yojana (PMKVY) The PMKVY has evolved through multiple iterations to address the skills gap. 5.1.1 PMKVY 4.0 (FY 2022-26)  Paradigm Shift: Moving away from classroom-based training, PMKVY 4.0 emphasizes On-Job Training (OJT). It partners with industries to train candidates on the shop floor, ensuring relevance.35  Green Jobs: The scheme includes specialized course modules for green roles.  Status: It continues to enroll candidates in 2026, with a focus on clearing the backlog of certifications and ensuring placement linkage.35 5.1.2 PMKVY 5.0 (2026 Onwards)  Future Outlook: While not fully launched, snippets indicate PMKVY 5.0 will focus heavily on Industry 4.0 and high-end tech skills (AI for Energy, Green Hydrogen handling) to support the NGHM and PLI schemes.36 5.2 Skill Council for Green Jobs (SCGJ) The SCGJ is the nodal body for defining the curriculum for the green transition. 5.2.1 Qualification Packs (QPs) Active in 2026 The SCGJ has developed and standardized training for specific roles:  Solar: Solar PV Installer (Suryamitra) (SGJQ0101), Rooftop Solar Grid Engineer (SGJQ0106).  Waste Management: E-Waste Recycling Entrepreneur (SGJQ0202), Waste Optimization Professional.37  Clean Cooking: Improved Cookstove Installer (SGJQ2101).  Hydrogen: New QPs are being rolled out for hydrogen handling and safety protocols.39 5.3 Inclusive Skilling: Jan Shikshan Sansthan (JSS)  Focus: Vocational training for non-literates and school dropouts in rural areas.  Digital Integration: In 2026, JSS has integrated Digital Financial Literacy into its curriculum. This ensures that beneficiaries (e.g., self-employed tailors or food processors) can use digital payments and access credit, bridging the digital divide.40  Reach: 289 JSS units operate across the country, with over 82 female beneficiaries.41 5.4 Deen Dayal Upadhyaya Grameen Kaushalya Yojana (DDU-GKY)  Status: Information indicates that DDU-GKY is undergoing a transition or restructuring in 2026, with some programs postponed or legacy data being migrated to new portals (Kaushal Bharat). This suggests a consolidation phase before a potential relaunch or merger with newer skilling missions.42 6. Green Entrepreneurship and Financing To catalyze innovation, the government provides specific financial instruments for green startups and MSMEs. 6.1 MSME Green Financing Schemes The Ministry of MSME and SIDBI run targeted schemes to lower the cost of capital for green projects. 6.1.1 MSE-GIFT (Green Investment and Financing for Transformation)  Objective: To help MSMEs adopt green technologies (e.g., solar rooftops, energy-efficient machinery).  Incentive: It offers Interest Subvention of 2 per annum for 5 years on term loans up to 2 crores.  Risk Sharing: A risk-sharing facility (RSF) covers collateral-free loans, encouraging banks to lend to perceived risky green projects.44 6.1.2 MSE-SPICE (Scheme for Promotion and Investment in Circular Economy)  Focus: Circular economy projects like recycling units or waste-to-energy plants.  Mechanism: It provides a capital subsidy (typically 25) to reduce the payback period for these capital-intensive projects. The scheme is operational until 2026-27 with an outlay of approx. 478 crore.45 6.2 Startup India Seed Fund Scheme (SISFS)  Relevance: While sector-agnostic, the scheme prioritizes green startups.  Funding: Grants of up to 20 lakhs for proof of concept and up to 50 lakhs for commercialization via convertible debentures. This early-stage capital is crucial for hardware-heavy green tech startups.47 6.3 TIDE 2.0 (Technology Incubation and Development of Entrepreneurs)  Managed by: MeitY (Ministry of Electronics and IT).  Thematic Area: Environment and Clean Tech is a core theme.  Support: It supports startups using emerging tech (IoT, AI, Blockchain) for environmental solutions. Grants (EiR up to 4 Lakhs, Grant up to 7 Lakhs) are disbursed through 51 incubators.48 7. Cooperative Federalism: State-Specific Initiatives States are implementing central mandates with their own top-up incentives, creating a competitive environment for green investment. 7.1 Uttar Pradesh: Green Hydrogen Policy  Capital Subsidy: UP offers a massive capital subsidy of up to 40 for the first 5 projects (capped at 225 Cr) and 30 for subsequent ones.  Land: Government land provided at nominal rates (1acreyear for PSUs).  Power: 100 exemption on electricity duty and transmission charges for 10 years.50 7.2 Gujarat: Renewable Energy Leadership  Surya Ghar Success: Gujarat leads in rooftop solar, driven by the Surya Ghar scheme. The state provides a seamless digital experience for subsidy disbursement.  Land Policy: The state facilitates mega-parks (e.g., Khavda) with streamlined allotment.  Subsidy: Fixed subsidies per kW (e.g., 30,000kW for small systems) are directly credited to beneficiaries.51 7.3 Tamil Nadu: Circular Economy Investment Policy 2026  Focus: Recycling-based industries (textile, auto, e-waste).  Incentives: 10 capital subsidy on fixed assets (capped at 3 crore) and payroll subsidies for green jobs.  Infrastructure: SIPCOT is developing low-carbon industrial parks with shared recycling infrastructure.53 8. Conclusion The year 2026 marks the maturation of Indias sustainability policy. The transition from announcement to implementation is visible across all sectors.  Energy: The NGHM and PM-KUSUM are actively building the physical infrastructure for a post-fossil fuel economy.  Ecology: MISHTI and Nagar Van are institutionalizing the value of natural capital.  Economy: CCTS and PM-PRANAM are successfully utilizing market mechanisms and fiscal federalism to price externalities and incentivize behavioral change.  People: PMKVY and SCGJ ensure that the Indian workforce is not left behind in this transition. For stakeholdersinvestors, policymakers, and entrepreneursthe roadmap is clear: the Indian state has aligned its considerable fiscal and regulatory power behind the green transition, creating a stable, long-term environment for sustainable growth. List of Tables Table 1: Funding Allocation for National Green Hydrogen Mission Pilot Projects Sector Allocation ( Crore) Active Period Objective Low Carbon Steel 455 Up to 2029-30 Replacement of coking coal with H2 in DRI Mobility 496 Up to 2025-26 Heavy-duty trucking  inter-city buses Shipping 115 Up to 2025-26 Green Ammonia bunkers  retrofitting Total Pilot Outlay 1,466 Table 2: Financial Assistance Norms for Key Afforestation Schemes Scheme Grant Norm Funding Source 202627 Target Nagar Van Yojana 4 Lakh  Hectare CAMPA 1,000 Urban Forests MISHTI 80:20 (Centre:State) MGNREGS  CAMPA 540 sq. km Mangroves Green India Mission Varies by Intervention GIM Budget Quality improvement of 5M ha Table 3: PM-KUSUM Component Breakdown Component Description Incentive  CFA Component A Decentralized Solar (GroundStilt) PPA with DISCOM (Feed-in Tariff) Component B Off-grid Solar Pumps 30 Centre  30 State Subsidy Component C Grid-connected Pumps (Solarization) 30 CFA; Surplus power sale to Grid Table 4: Key Green Skill Qualification Packs (SCGJ) Job Role Code Focus Area Solar PV Installer (Suryamitra) SGJQ0101 Installation  Maintenance Rooftop Solar Grid Engineer SGJQ0106 Grid Integration  Safety E-Waste Recycling Entrepreneur SGJQ0202 Circular Economy Business Improved Cookstove Installer SGJQ2101 Clean Cooking Solutions Works cited 1. National Green Hydrogen Mission  MINISTRY OF NEW AND RENEWABLE ENERGY  India, accessed on January 23, 2026, https:mnre.gov.inennational-green-hydrogen-mission 2. National Green Hydrogen Mission - NSWS, accessed on January 23, 2026, https:www.nsws.gov.inportalschemegreenhydrogenpolicy 3. NATIONAL GREEN HYDROGEN MISSION - Principal Scientific Adviser, accessed on January 23, 2026, https:psa.gov.inCMSwebsitesdefaultfilespublicationGreen20Hydrogen2 0Mission_Jan20202320by20MNRE.pdf 4. BIRAC-Call For Proposal, accessed on January 23, 2026, https:birac.nic.incfp_view.php?id116scheme_type52 5. Pradhan Mantri Kisan Urja Suraksha evam Utthaan Mahabhiyaan (PM KUSUM)  MINISTRY OF NEW AND RENEWABLE ENERGY, accessed on January 23, 2026, https:mnre.gov.inenpradhan-mantri-kisan-urja-suraksha-evam-utthaan-maha bhiyaan-pm-kusum 6. PM-KUSUM Yojana - Solar Energy Scheme - IBEF, accessed on January 23, 2026, https:www.ibef.orggovernment-schemespm-kusum-yojana 7. Amendment in the PM-KUSUM Scheme to ease implementation inter-alia include - PIB, accessed on January 23, 2026, https:www.pib.gov.inPressReleaseIframePage.aspx?PRID1907703 8. PM-KUSUM Scheme: Extended to 2026, Empowering Farmers with Solar Power - Karma AI, accessed on January 23, 2026, https:karma.lawinsightslaw-librarypm-kusum-scheme-extended-to-2026-em powering-farmers-with-solar-power 9. Schemes  MINISTRY OF NEW AND RENEWABLE ENERGY  India, accessed on January 23, 2026, https:mnre.gov.inenpolicies-and-regulationsschemes-and-guidelinesscheme s 10.About-Us  GOBARdhan Unified Registration Portal - Swachh Bharat Mission, accessed on January 23, 2026, https:gobardhan.sbm.gov.inabout-us 11.GOBARdhan Scheme Crosses 500 Biogas Plants Milestone, CBG Push Gathers Pace, accessed on January 23, 2026, https:www.republicworld.combusinessgobardhan-scheme-crosses-500-biog as-plants-milestone-cbg-push-gathers-pace 12.GOBARdhan Unified Registration Portal, accessed on January 23, 2026, https:gobardhan.eil.co.inimportant-circular 13.Direct Pipeline Infrastructure (DPI): - About the Scheme for CGD Connectivity, accessed on January 23, 2026, https:dpi.eil.co.inDPI-About20the20Scheme.pdf 14.PM-PRANAM Scheme - Drishti IAS, accessed on January 23, 2026, https:www.drishtiias.comdaily-updatesdaily-news-analysispm-pranam-schem e-1 15.GOVERNMENT OF INDIA MINISTRY OF CHEMICALS AND FERTILIZERS DEPARTMENT OF FERTILIZERS RAJYA SABHA UNSTARRED QUESTION NO. 2573 TO, accessed on January 23, 2026, https:sansad.ingetFileannex268AU2573_TNgWHm.pdf?sourcepqars 16.PM Pranam Scheme: Details and Key Feature Explained - Swipe, accessed on January 23, 2026, https:getswipe.inblogarticlepm-pranam-scheme-key-features-and-eligibility- details 17.About PM-PRANAM  Legacy IAS Academy, accessed on January 23, 2026, https:www.legacyias.comabout-pm-pranam 18.NATIONAL BAMBOO DEVELOPMENT STRATEGY AND ACTION PLAN 2023  2031, accessed on January 23, 2026, https:faolex.fao.orgdocspdftan231737.pdf 19.Nagar Van Yojana Scheme Objectives, Key Features, Benefits - PWOnlyIAS, accessed on January 23, 2026, https:pwonlyias.comnagar-van-yojana 20.OIH GOVERNMENT OF INDIA MINISTRY OF ENVIRONMENT, FOREST AND CLIMATE CHANGE LOK SABHA UNSTARRED QUESTION NO. 2578 TO BE ANSWERED, accessed on January 23, 2026, https:sansad.ingetFileloksabhaquestionsannex184AU2578_Dv7Ba3.pdf?sourc epqals 21.Nagar Van Yojana, Objectives, Key Features, Significance - Physics Wallah, accessed on January 23, 2026, https:www.pw.liveupscexamsnagar-van-yojana 22.documentation of achievements under nagar van yojana - Environment, Forests  Climate Change Department, accessed on January 23, 2026, https:forest.mizoram.gov.inuploadsattachments20250864e0f98c3253d3474 985e90e6d981b7bpart-i-1-21.pdf 23.National Mission for a GREEN INDIA - Ministry of Environment, Forest and Climate Change, accessed on January 23, 2026, https:moef.gov.inuploads201708Revised20Mission20Document.pdf 24.Revised Green India Mission - PMF IAS, accessed on January 23, 2026, https:www.pmfias.comrevised-green-india-mission 25.Mangrove Afforestation  MISHTI Scheme  Environmental Conservation  Coastal Livelihoods  Gujarat Government - IAS Gyan, accessed on January 23, 2026, https:www.iasgyan.indaily-current-affairsmishti 26.National Level Workshop on MISHTI Held in Vijayawada, Andhra Pradesh - PIB, accessed on January 23, 2026, https:www.pib.gov.inPressReleasePage.aspx?PRID22127603lang1 27.Amrit Dharohar - Wetlands of India Portal, accessed on January 23, 2026, https:indianwetlands.inwp-contentuploadslibrary1686133937.pdf 28.Amrit Dharohar Capacity Building Scheme - Drishti IAS, accessed on January 23, 2026, https:www.drishtiias.comdaily-updatesdaily-news-analysisamrit-dharohar-cap acity-building-scheme 29.India Expands Greenhouse Gas Emission Intensity Targets Under Carbon Credit Trading Scheme - CCarbon, accessed on January 23, 2026, https:www.ccarbon.infonewsindia-expands-greenhouse-gas-emission-intensit y-targets-under-carbon-credit-trading-scheme 30.Govt adds 4 new sectors to mandatory greenhouse gas reduction regime, accessed on January 23, 2026, https:auto.economictimes.indiatimes.comnewsindustrygovt-adds-4-new-sect ors-to-mandatory-greenhouse-gas-reduction-regime126768484 31.Indian Carbon Credit Trading Scheme - International Carbon Action Partnership (ICAP), accessed on January 23, 2026, https:icapcarbonaction.comenetsindian-carbon-credit-trading-scheme 32.Green Credit Programme - moefcc-gcp.in, accessed on January 23, 2026, https:www.moefcc-gcp.inaboutaboutGCP 33.The Green Credit Rules: Unlocking Sustainable Growth - GCESCJ, accessed on January 23, 2026, https:www.gcescj.inpostthe-green-credit-rules-unlocking-sustainable-growth 34.Registry Guidelines - moefcc-gcp.in, accessed on January 23, 2026, https:www.moefcc-gcp.inregistryguidelines 35.guidelines for pradhan mantri kaushal vikas yojana 4.0 - Ministry of Skill Development and Entrepreneurship, accessed on January 23, 2026, https:www.msde.gov.instaticuploads202402PMKVY-4.0-Guidelines_final-co py.pdf 36.Pradhan Mantri Kaushal Vikas Yojana (PMKVY): Empowering Indias Skilled Workforce, accessed on January 23, 2026, https:www.skillreporter.comschemespmkvypradhan-mantri-kaushal-vikas-yoj ana-pmkvy-pmkvy-5-0 37.Green Skill Development Programs (GSDP) - EPTRI, accessed on January 23, 2026, https:eptri.telangana.gov.ingspd 38.Skill Council for Green Jobs -  National Skill Development Corporation (NSDC), accessed on January 23, 2026, https:nsdcindia.orgnos-listing39 39.SCGJ  Welcome to SCGJ  SKILL COUNCIL for GREEN JOBS  Skill, Solar , Suryamitra, Green Jobs, Skill India, PMKVY, NSDC, Renewable, Capacity Builiding, Swachh Bharat, National Solar Mission, Wind Energy, Waste Management, Training, Asssessment, QP, Qualification Packs, Sustainable, Environment, SDGs, accessed on January 23, 2026, https:sscgj.in 40.MSDE to Organise Jan Shikshan Sansthan Zonal Conference and Stakeholder Consultation in Pune on 19-20 January 2026 - PIB, accessed on January 23, 2026, https:www.pib.gov.inPressReleasePage.aspx?PRID2215780 41.Jan Shikshan Sansthan (JSS) - Ministry of Skill Development and Entrepreneurship, accessed on January 23, 2026, https:xn--o1bna6ezc1cxc.xn--11b7cb3a6a.xn--h2brj9cofferingsschemes-and-s ervicesdetailsjan-shikshan-sansthan-jss-cjM4ATMtQWa 42.DDU-GKY State Wise Details - Kaushal Bharat, accessed on January 23, 2026, https:kaushalbharat.gov.inddugky-reportcandidateview 43.DDUGKY, accessed on January 23, 2026, http:ddugky.info 44.Green MSME Portal: Home Page, accessed on January 23, 2026, https:green.msme.gov.in 45.Scheme Guidelines - DCMSME, accessed on January 23, 2026, https:www.dcmsme.gov.inCLCS_TUS_SchemeGIFTsMSE_GIFT20_Scheme_ Operating_Guidelines.pdf 46.MSME SPICE Guidelines - MOEFCC, accessed on January 23, 2026, https:suppwmdashboard.inuploadscontent_managerMSE_SPICE_English.pdf 47.Startup India Seed Fund Scheme (SISFS), accessed on January 23, 2026, https:seedfund.startupindia.gov.in 48.A Decade of Startup India - PIB, accessed on January 23, 2026, https:www.pib.gov.inPressReleasePage.aspx?PRID22148723lang1 49.MeitY TIDE 2.0 GrantSeed Fund at AIC Banasthali (For Women Entrepreneurs), accessed on January 23, 2026, https:www.startupgrantsindia.commeity-tide-2-0-grant-seed-fund-aic-banast hali-women-entrepreneurs-180 50.Green Hydrogen Policy  Official Website of Invest UP, Government of Uttar Pradesh, India, accessed on January 23, 2026, https:invest.up.gov.ingreen-hydrogen-policy 51.Subsidized Rooftop Solar Systems, accessed on January 23, 2026, https:www.trendhunter.comtrendsstate-of-gujarat 52.Solar in Gujarat: Potential, Solar Policy and Subsidy (2025), accessed on January 23, 2026, https:ornatesolar.comblogpotential-of-solar-power-in-gujarat 53.TN circular economy policy to give push to recycling industries, accessed on January 23, 2026, https:www.newindianexpress.comstatestamil-nadu2026Jan20tn-circular-ec onomy-policy-to-give-push-to-recycling-industries The 2026 India Sustainability  Skilling Masterfile: Active Government Schemes, Data  Direct Links Document Status: Live  Active for FY 2025-26 Coverage: Central Sector  Centrally Sponsored Schemes Purpose: Training Data for LLM  Reference for Policymakers  Entrepreneurs 1. Sustainability  Energy Transition Schemes focused on renewable energy, waste-to-wealth, and carbon reduction. 1.1. PM-Surya Ghar: Muft Bijli Yojana This is the flagship residential solar scheme for 2026, targeting 1 crore households.  Objective: Provide free electricity (up to 300 units) via rooftop solar and allow selling of surplus power.  Subsidy Structure (2026):  1 kW System: 30,000 subsidy.  2 kW System: 60,000 subsidy.  3 kW System: 78,000 subsidy (Fixed cap for systems 3 kW).  Financing: Collateral-free loans available at Repo Rate  0.5 (approx. 7).  Official Portal: suspicious link removed 1.2. PM E-DRIVE (PM Electric Drive Revolution in Innovative Vehicle Enhancement) Replacing the FAME-II scheme, PM E-DRIVE is the active mobility scheme valid until March 31, 2026.  Outlay: 10,900 Crore.  Incentives (e-Vouchers):  e-2W (Two Wheelers): 2,500 - 5,000 per kWh of battery capacity. Cap: 10,000vehicle.  e-3W (Three Wheelers): 5,000 per kWh. Targeted at commercial autorickshaws.  e-Trucks: Incentives for scrapping old trucks and buying electric ones.  e-Buses: 4,391 Cr allocated for public transport agencies.  Official Portal: https:pmedrive.heavyindustries.gov.in 1.3. National Green Hydrogen Mission (NGHM)  Program Name: SIGHT (Strategic Interventions for Green Hydrogen Transition).  Objective: Production of 5 Million Metric Tonnes (MMT) of Green Hydrogen by 2030.  Financial Incentives:  Component I: Incentives for domestic Electrolyser Manufacturing (4,440 Cr).  Component II: Direct subsidy for Green Hydrogen Production (13,050 Cr).  Pilot Projects: Funding available for using Green Hydrogen in Steel (455 Cr), Shipping (115 Cr), and Transport (496 Cr).  Official Portal: https:nghm.mnre.gov.in 1.4. GOBARdhan (Galvanizing Organic Bio-Agro Resources Dhan)  Focus: Converting cattle dungagri-waste into BiogasCBG (Compressed Biogas).  Key Benefit: Market Development Assistance (MDA) of 1,500 per MT for the sale of Fermented Organic Manure (FOM) produced from biogas plants.  Support: Financial assistance of up to 50 Lakh per district for community clusters.  Official Portal: https:gobardhan.sbm.gov.in 1.5. PM-PRANAM  Full Name: Programme for Restoration, Awareness, Nourishment and Amelioration of Mother Earth.  Mechanism: Incentivizes States to reduce chemical fertilizer usage. 50 of the subsidy savings are passed back to the State as a grant.  Usage: States use these funds to create assets for organic farming and alternative fertilizers.  Link (Dept of Fertilizers): https:fert.nic.in 2. Green Skill Development Specialized technical training for the green economy. 2.1. Green Skill Development Programme (GSDP) Managed by the Ministry of Environment, Forest  Climate Change (MoEFCC) utilizing ENVIS Hubs.  Target: Skilling youth in environment and forest sectors for employmentself-employment.  Active Courses (2026):  Pollution Monitors (AirWaterSoil).  Effluent Treatment Plant (ETPSTP) Operation.  Waste Management Specialists.  Bamboo Crafts  Livelihood.  Parataxonomy (Biodiversity identification).  Official Portal: http:gsdp-envis.gov.in 2.2. Suryamitra Skill Development Programme  Implementation: National Institute of Solar Energy (NISE).  Course Details: 600-hour residential training for ITIDiploma holders to become Solar PV Installers.  Employment: Mandatory for vendors under PM-Surya Ghar to employ certified Suryamitras.  Official Portal: https:suryamitra.nise.res.in 2.3. Skill Council for Green Jobs (SCGJ) Initiatives  Role: The awarding body for green certifications.  Key Qualification Packs (QPs):  Green Hydrogen Technician.  Solar Proposal Evaluation Specialist.  Improved Cookstove Installer.  Agri-Residue Aggregator (Biomass).  Official Portal: https:sscgj.in 3. Skill Development (Financial, Technical, Leadership) Broader human capital schemes with specific components for inclusion and leadership. 3.1. Pradhan Mantri Kaushal Vikas Yojana (PMKVY) 4.0  Focus: Industry 4.0, On-the-Job Training (OJT), and codingAI skills.  Components:  Short Term Training (STT): 200-600 hours for fresh skilling.  Recognition of Prior Learning (RPL): Certification for workforce with existing skills.  Financial Norms: Base training cost 49hour (Category I trades). Payouts linked to certification and placement.  Official Portal: https:www.skillindiadigital.gov.in 3.2. National Apprenticeship Promotion Scheme (NAPS 2.0)  Objective: Promoting apprenticeship by sharing cost with employers.  Financial Benefit: Govt shares 25 of the stipend payable to the apprentice, capped at 1,500 per month.  Mechanism: Direct Benefit Transfer (DBT) to the apprentices bank account.  Official Portal: https:www.apprenticeshipindia.gov.in 3.3. Financial Literacy Initiatives (RBINCFE)  National Centre for Financial Education (NCFE): Implements the Financial Education Programme for Adults (FEPA) targeting farmers, SHGs, and rural youth.  Centre for Financial Literacy (CFL): Pilot project by RBINABARD to set up literacy centers at the block level.  RBI Financial Literacy Week 2026: Theme focused on Financial Literacy - Womens Prosperity (Feb 2026).  Official Portal: https:ncfe.org.in 3.4. Rashtriya Yuva Sashaktikaran Karyakram (RYSK)  Objective: Leadership development for youth (15-29 years).  Components:  National Youth Corps (NYC): Volunteers deployed for nation-building activities (Honorarium 5000mo).  National Young Leaders Programme (NYLP): Leadership training, Shramadaan (voluntary labour), and community service.  Official Portal: https:yas.nic.in 3.5. PM VIKAS (Pradhan Mantri Virasat Ka Samvardhan)  Target: Minorities and Artisan communities.  Leadership Component: Women Leadership and Entrepreneurship tracks to train minority women in business management and leadership roles.  Official Portal: https:pmvikas.minorityaffairs.gov.in 4. Afforestation  Plantation Schemes for ecological restoration and carbon sinks. 4.1. Nagar Van Yojana (Urban Forests)  Target: Creation of 1,000 Nagar Vans by 2027.  Funding: Paid from CAMPA funds.  Grant: 4 Lakh per hectare for development and maintenance.  Cap: Maximum grant of 2 Crore per project (approx 50 hectares).  Requirements: Minimum 10 hectares area; 23rd area must have dense tree cover.  Official Portal: https:naeb.nic.in (under MoEFCC) 4.2. MISHTI (Mangrove Initiative for Shoreline Habitats  Tangible Incomes)  Objective: Mangrove reforestation along the coastline and salt pans.  Funding Model: Convergence of MGNREGS (80) for labor and CAMPA (20) for materialsaplings.  Official Portal: https:nationalcampa.nic.in 4.3. Green Credit Programme (GCP)  Concept: A market mechanism where entities earn Green Credits for voluntary tree plantation on degraded land.  Key 2026 Feature: Green Credits can be used to offset Compensatory Afforestation (CA) obligations, giving them high monetary value for industries requiring forest land diversion.  Registration: Land banks and plantation projects must be registered on the portal.  Official Portal: https:moefcc-gcp.in 4.4. National Bamboo Mission  Goal: To increase the area under bamboo plantation in non-forest Government and private lands.  Subsidy: 50 subsidy for bamboo plantation (different rates for different speciesspacing).  Official Portal: https:nbm.nic.in 5. Green Entrepreneurship Funding and support for startups and MSMEs in the green sector. 5.1. Bio-RIDE (Biotechnology Research Innovation and Entrepreneurship Development)  Launch: Late 2024Early 2025 (Fully active 2026).  Focus: Biomanufacturing, Bio-foundries, and Synthetic Biology.  Grants:  Startup Grant: Up to 50 Lakhs for proof-of-concept.  PACE (Promoting Academic Research Conversion to Enterprise): Funding for validation and scale-up.  Official Portal: https:dbtindia.gov.in 5.2. MSE-GIFT (Green Investment and Financing for Transformation)  Agency: SIDBI.  Objective: Financing Green MSMEs.  Incentive: Interest Subvention of 2 on green loans.  Risk Sharing: Provides a credit guarantee to banks to encourage lending to green projects without collateral.  Official Portal: https:www.sidbi.in 5.3. MSE-SPICE (Scheme for Promotion and Investment in Circular Economy)  Focus: Circular Economy projects (Waste-to-wealth, Recycling).  Benefit: Capital subsidy (typically 25) for setting up recycling or circular economy units.  Official Portal: https:green.msme.gov.in 5.4. PM Vishwakarma (Green Tools Component)  Target: Artisans (Potters, Carpenters, Boat makers).  Green Aspect: 15,000 Toolkit Incentive specifically for modern, energy-efficient tools (e.g., electric wheels for potters) that reduce drudgery and emissions.  Loans: Collateral-free up to 3 Lakh at 5 interest.  Official Portal: https:pmvishwakarma.gov.in 5.5. TIDE 2.0 (Technology Incubation and Development of Entrepreneurs)  Ministry: MeitY.  Thematic Area: Environment  Clean Tech (IoT, AI for Green Energy).  Grants:  EiR (Entrepreneur-in-Residence): 4 Lakh.  Grant-in-Aid: Up to 7 Lakh for prototype development.  Official Portal: https:meitystartuphub.in 6. Master Reference Table for LLM Training (Data Extraction) Category Schem e ID Scheme Name Key Data Point  Incentive Official URL Sustainability SCH_00 1 PM-Surya Ghar Subsidy: 78,000 for 3kW system pmsuryaghar.gov.in Sustainability SCH_00 2 PM E-DRIVE Outlay: 10,900 Cr; e-2W subsidy: 5kkWh pmedrive.heavyindustries. gov.in Sustainability SCH_00 3 Nat. Green Hydrogen Target: 5 MMT production; SIGHT incentive nghm.mnre.gov.in Sustainability SCH_00 4 GOBARdha n MDA: 1,500MT for organic manure gobardhan.sbm.gov.in Green Skilling SCH_00 5 GSDP Training in Pollution Monitoring, ETP gsdp-envis.gov.in Green Skilling SCH_00 6 Suryamitra 600-hr solar installer training suryamitra.nise.res.in Skilling SCH_00 7 PMKVY 4.0 Base Cost: 49hr; Industry 4.0 focus skillindiadigital.gov.in Skilling SCH_00 8 NAPS 2.0 25 Stipend support (Max 1,500) apprenticeshipindia.gov.in Leadership SCH_00 9 RYSK  NYC Youth Volunteer Honorarium: 5,000mo yas.nic.in Afforestation SCH_01 0 Nagar Van Yojana Grant: 4 Lakhha; Cap: 2 Cr naeb.nic.in Afforestation SCH_01 1 Green Credit Prog Credits tradable for Compensat ory Afforestatio n moefcc-gcp.in Entrepreneurs hip SCH_01 2 Bio-RIDE Startup Grant: 50 Lakh dbtindia.gov.in Entrepreneurs hip SCH_01 3 MSE-GIFT 2 Interest Subvention for Green Loans sidbi.in Entrepreneurs hip SCH_01 4 PM Vishwakar ma 15,000 Toolkit Voucher (Green Tools) pmvishwakarma.gov.in",
  "chunks": [
    "Indias Sustainability Architecture 2026: A Comprehensive Assessment of Government Schemes for Green Growth, Skilling, and Ecological Restoration Executive Summary The fiscal year 2026 represents a watershed moment in the economic and ecological history of India. Following the foundational commitments made at COP26 in Glasgow and the subsequent enhancement of Nationally Determined Contributions (NDCs), the Government of India has systematically re-engineered its policy framework to align economic development with climate resilience. This report provides an exhaustive, expert-level analysis of the active government schemes in India as of 2026, encompassing the interlocking domains of sustainability, green skills, general workforce development, afforestation, and green entrepreneurship. Our analysis reveals a paradigm shift in governance strategy: a transition from fragmented, input-based subsidies to integrated, outcome-based incentive structures. The policy landscape of 2026 is characterized by the convergence of energy security, livelihood generation, and ecological stewardship. Key flagships such as the National Green Hydrogen Mission and PM-KUSUM have been capitalized with substantial outlays to drive the installation of 500 GW of non-fossil fuel capacity by 2030. Simultaneously, the rural economy is being reimagined through schemes like PM-PRANAM and GOBARdhan, which utilize fiscal federalism to reduce chemical dependency and monetize organic waste, thereby creating a circular bio-economy. In the domain of human capital, the demographic dividend is being leveraged through the active implementation of PMKVY 4.0 and the strategic rollout of PMKVY 5.0. These initiatives mark a decisive pivot toward Green Jobs, institutionalized by the Skill Council for Green Jobs (SCGJ), ensuring that the workforce transition keeps pace with the industrial transition. Furthermore, the operationalization of market-based instrumentsspecifically the Green Credit Programme (GCP) and the",
    "implementation of PMKVY 4.0 and the strategic rollout of PMKVY 5.0. These initiatives mark a decisive pivot toward Green Jobs, institutionalized by the Skill Council for Green Jobs (SCGJ), ensuring that the workforce transition keeps pace with the industrial transition. Furthermore, the operationalization of market-based instrumentsspecifically the Green Credit Programme (GCP) and the Carbon Credit Trading Scheme (CCTS)signals the maturity of Indias environmental policy, moving beyond command-and-control regulation to sophisticated market mechanisms that price externalities. This report synthesizes data from active guidelines, ministry notifications, and implementation frameworks active in 2026. It offers a granular examination of scheme mechanics, funding patterns, eligibility criteria, and the broader strategic implications of Indias green transition. 1. The Energy Transition: Strategic Missions and Renewable Infrastructure The energy sector remains the fulcrum of Indias sustainability strategy. By 2026, the focus has broadened from simple capacity addition to the creation of resilient value chains, indigenous manufacturing capabilities, and the decarbonization of hard-to-abate heavy industries. 1.1 National Green Hydrogen Mission (NGHM) The National Green Hydrogen Mission, launched with an initial outlay of 19,744 crore, has entered its most critical execution phase in 2026.1 Having established the policy groundwork, the mission is now actively funding pilot projects and disbursing incentives to establish India as a global hub for the production, usage, and export of green hydrogen and its derivatives. 1.1.1 Mission Architecture and 2030 Targets The mission is anchored by the ambition to achieve a green hydrogen production capacity of at least 5 Million Metric Tonnes (MMT) per annum by 2030. This production target is supported by a requisite renewable energy capacity addition of approximately 125 GW, specifically dedicated to powering electrolysers.2 The economic logic of the mission is predicated on two outcomes:",
    "is anchored by the ambition to achieve a green hydrogen production capacity of at least 5 Million Metric Tonnes (MMT) per annum by 2030. This production target is supported by a requisite renewable energy capacity addition of approximately 125 GW, specifically dedicated to powering electrolysers.2 The economic logic of the mission is predicated on two outcomes: import substitution and export leadership. By displacing fossil fuel imports, the mission aims to save 1 lakh crore annually while attracting cumulative investments totaling 8 lakh crore.2 In 2026, the missions overarching objective is explicitly defined: to make India Aatmanirbhar (self-reliant) in clean energy and to serve as an inspiration for the global clean energy transition.1 This geopolitical dimension is critical, as it positions India not just as a consumer of green technology, but as a primary producer and exporter. 1.1.2 Pilot Project Implementation and Funding To bridge the gap between laboratory success and commercial viability, the mission has allocated specific outlays for pilot projects in three strategic sectors. These pilots are designed to validate technical feasibility and establish safety standards. Low Carbon Steel Projects (455 Crore): Active up to FY 2029-30, this window supports the steel industrys transition from coking coal to green hydrogen. Steel production is a major carbon emitter, and replacing carbon with hydrogen as a reducing agent in Direct Reduced Iron (DRI) furnaces is a technological frontier this scheme seeks to breach.1 The extended timeline reflects the capital-intensive nature of steel plant retrofitting. Mobility Pilot Projects (496 Crore): Active until 2025-26, this funding targets the heavy-duty transport segment. While battery electric vehicles (BEVs) dominate personal mobility, hydrogen fuel cells are viewed as the optimal solution for long-haul trucking and inter-city buses due to their higher energy density and faster refueling times.1 Shipping Pilot Projects (115 Crore): Active until 2025-26, this component",
    "plant retrofitting. Mobility Pilot Projects (496 Crore): Active until 2025-26, this funding targets the heavy-duty transport segment. While battery electric vehicles (BEVs) dominate personal mobility, hydrogen fuel cells are viewed as the optimal solution for long-haul trucking and inter-city buses due to their higher energy density and faster refueling times.1 Shipping Pilot Projects (115 Crore): Active until 2025-26, this component addresses the decarbonization of the maritime sector. Initiatives include the development of green ammonia bunkers at major ports and the retrofitting of vessels to run on green methanol or hydrogen.1 The mission also retains flexibility to fund pilots in decentralized energy applications, hydrogen production from biomass, and hydrogen storage technologies, acknowledging that the optimal use-cases for hydrogen may evolve.1 1.1.3 Strategic Interventions for Green Hydrogen Transition (SIGHT) The financial engine of the mission is the SIGHT programme, which commands the bulk of the outlay (17,490 crore).3 SIGHT is structured as a Production Linked Incentive (PLI) mechanism with two distinct components: 1. Component I: Electrolyser Manufacturing: To reduce the capital cost of green hydrogen, India must manufacture electrolysers domestically. This component offers incentives per kilowatt of manufacturing capacity. By 2026, Tranche-II of this scheme is active, supporting the scale-up of gigafactories for Alkaline, PEM, and Solid Oxide technologies. 2. Component II: Green Hydrogen Production: This component provides a direct subsidy per kilogram of green hydrogen produced. The incentive is designed to bridge the viability gap between grey hydrogen (produced from natural gas) and green hydrogen. The subsidy tapers down over a three-year period, forcing producers to achieve efficiency gains and cost reductions over time.3 1.1.4 Research and Development: The Horizon 2030 To prevent technological dependency, the mission aggressively funds RD. The strategy distinguishes between incremental innovation for",
    "to bridge the viability gap between grey hydrogen (produced from natural gas) and green hydrogen. The subsidy tapers down over a three-year period, forcing producers to achieve efficiency gains and cost reductions over time.3 1.1.4 Research and Development: The Horizon 2030 To prevent technological dependency, the mission aggressively funds RD. The strategy distinguishes between incremental innovation for immediate deployment and Blue Sky Projects with a 0-15 year horizon.3 Focus Areas: Development of efficient, low-cost electrolysers, Type-IV storage cylinders, and next-generation fuel cells. Active Calls: The Biotechnology Industry Research Assistance Council (BIRAC) has active calls for proposals until January 27, 2026, specifically targeting biomass-based hydrogen production technologies at Technology Readiness Levels (TRL) 56.4 This focus on biomass leverages Indias agrarian economy to produce bio-hydrogen, creating a unique value proposition compared to solar-based hydrogen. 1.2 Pradhan Mantri Kisan Urja Suraksha evam Utthaan Mahabhiyan (PM-KUSUM) The PM-KUSUM scheme, extended until March 31, 2026, represents one of the most significant interventions in the rural energy landscape.5 It addresses the Water-Energy-Food Nexus by solarizing agricultural power consumption, thereby reducing the subsidy burden on State DISCOMs and providing reliable daytime power to farmers. 1.2.1 Component Architecture and Strategic Targets The scheme envisions adding a total solar capacity of 34,800 MW by March 2026, supported by Central Financial Support of 34,422 crore.5 The architecture comprises three interlinked components: Component Target Description Strategic Rationale Component A 10,000 MW of Decentralized GroundStilt Mounted Solar Plants Allows farmers to become energy producers (Annadata to Urjadata) by leasing barren lands for solar plants (up to 2 MW). Component B 14 Lakh Stand-alone Solar Agriculture Pumps Targets off-grid areas where grid extension is prohibitively expensive, replacing diesel pumps and reducing carbon",
    "Strategic Rationale Component A 10,000 MW of Decentralized GroundStilt Mounted Solar Plants Allows farmers to become energy producers (Annadata to Urjadata) by leasing barren lands for solar plants (up to 2 MW). Component B 14 Lakh Stand-alone Solar Agriculture Pumps Targets off-grid areas where grid extension is prohibitively expensive, replacing diesel pumps and reducing carbon emissions. Component C Solarization of 15 Lakh Grid-connected Pumps Reduces the agricultural subsidy burden for DISCOMs by allowing farmers to generate their own power and sell surplus to the grid. 1.2.2 Key Operational Amendments for 2026 To accelerate adoption and overcome implementation hurdles, the Ministry of New and Renewable Energy (MNRE) has introduced several critical amendments active in 2026: 1. Feeder Level Solarization (FLS): Under Component C, the focus has shifted from solarizing individual pumps to solarizing entire agricultural feeders. This creates a virtual solar power plant at the substation level. It simplifies metering, billing, and grid management for DISCOMs while ensuring that all pumps on a feeder receive solar power.7 2. Land Use Flexibility: Recognizing the scarcity of purely barren land, the guidelines now permit the installation of solar plants on pasturelands and marshlands, provided the primary ecological function is not compromised. This is particularly relevant for states with high wetland density.7 3. Waiver of Domestic Content Requirement (DCR): A major bottleneck has been the shortage of domestically manufactured solar cells. To unblock projects, the DCR mandate was waived for feeder-level solarization projects awarded on or before June 20, 2023. This waiver continues to facilitate project execution in 2026.8 4. Removal of Generation Penalties: The penalty on solar power generators for shortfall in generation under Component A has been removed. This significantly de-risks the investment for farmers and developers who previously faced fines for weather-related generation dips.7 1.2.3 Financial Assistance and",
    "projects awarded on or before June 20, 2023. This waiver continues to facilitate project execution in 2026.8 4. Removal of Generation Penalties: The penalty on solar power generators for shortfall in generation under Component A has been removed. This significantly de-risks the investment for farmers and developers who previously faced fines for weather-related generation dips.7 1.2.3 Financial Assistance and Regional Variations Standard CFA: The Central Financial Assistance (CFA) is typically capped at 30 of the benchmark cost or the tender cost, whichever is lower. Special Category States: For North-Eastern States, JK, Ladakh, Himachal Pradesh, and Uttarakhand, the CFA is higher. Furthermore, for these regions, CFA is available for pump capacities up to 15 HP (compared to the standard 7.5 HP cap) to account for the higher lift requirements in hilly terrain.8 Inter-Component Flexibility: States are permitted to transfer physical targets between Component B and Component C based on local demand, ensuring that the overall capacity target of 34,800 MW is met efficiently.6 1.3 Production Linked Incentive (PLI) for Solar PV Modules While primarily an industrial policy, the PLI Scheme for High Efficiency Solar PV Modules is the supply-side counterpart to PM-KUSUM and the Rooftop Solar programme. Tranche II Status: With an outlay of 14,007 crore, Tranche II allocated 39,600 MW of manufacturing capacity. 2026 Milestone: The scheme mandates that the final block of capacity (approximately 15,400 MW) must become operational by April 2026.9 This ensures that as demand peaks under PM-KUSUM and the Green Hydrogen Mission, a robust domestic supply chain of high-efficiency modules is available to meet it. 2. The Bio-Economy: Waste-to-Wealth and Sustainable Agriculture Indias strategy for the rural economy in 2026 is defined by circularity. Schemes are designed to close the loopturning agricultural waste into energy and returning nutrients to the soil. 2.1 GOBARdhan (Galvanizing Organic Bio-Agro Resources Dhan) The GOBARdhan initiative is",
    "Mission, a robust domestic supply chain of high-efficiency modules is available to meet it. 2. The Bio-Economy: Waste-to-Wealth and Sustainable Agriculture Indias strategy for the rural economy in 2026 is defined by circularity. Schemes are designed to close the loopturning agricultural waste into energy and returning nutrients to the soil. 2.1 GOBARdhan (Galvanizing Organic Bio-Agro Resources Dhan) The GOBARdhan initiative is a Whole of Government approach to converting organic waste (cattle dung, agri-residue) into biogas, Compressed Biogas (CBG), and Bio-CNG. It operates under the umbrella of the Swachh Bharat Mission (Grameen) Phase II.10 2.1.1 Implementation Framework (2020-2026) The scheme is operational through FY 2025-26 with the following key provisions: Cluster Model: It supports the setting up of community and cluster-based biogas plants. Financial Assistance: A specialized grant of up to 50 lakhs per district is available to catalyze local projects.10 Unified Registration Portal: This portal acts as the single window for registration, a mandatory step to access benefits across converging ministries (MNRE, MoPNG, Dept of Fertilizers).11 2.1.2 Market Development and Offtake Security The success of GOBARdhan in 2026 is driven by aggressive market creation policies: 1. Mandatory Blending: The government has notified a phase-wise mandatory blending of CBG in the CNG (transport) and PNG (domestic) segments. This creates a guaranteed demand sink for producers, de-risking their capital investment.11 2. Excise Exemptions: To ensure price competitiveness against fossil gas, central excise duty exemptions have been extended to CNG blended with CBG.11 3. Pipeline Infrastructure (DPI) Scheme: Launched to address logistics, the Development of Pipeline Infrastructure (DPI) scheme funds the construction of pipelines connecting CBG plants to the nearest City Gas Distribution (CGD) network. Revised guidelines in August 2025 streamlined the injection standards, facilitating seamless grid integration.12 4. Biomass Aggregation",
    "exemptions have been extended to CNG blended with CBG.11 3. Pipeline Infrastructure (DPI) Scheme: Launched to address logistics, the Development of Pipeline Infrastructure (DPI) scheme funds the construction of pipelines connecting CBG plants to the nearest City Gas Distribution (CGD) network. Revised guidelines in August 2025 streamlined the injection standards, facilitating seamless grid integration.12 4. Biomass Aggregation Machinery (BAM): Financial assistance is provided for procuring the heavy machinery (balers, rakes) required to collect biomass from fields, addressing the critical supply chain bottleneck of feedstock availability.11 2.1.3 Monetization of Bio-Slurry The scheme acknowledges that biogas production generates a nutrient-rich byproduct: bio-slurry. Fertilizer Control Order (FCO): Fermented Organic Manure (FOM) and Liquid FOM (LFOM) are now recognized fertilizers under the FCO. Market Development Assistance (MDA): A subsidy of 1,500 per metric tonne is provided for the sale of FOMLFOM. This makes organic manure price-competitive for farmers, simultaneously improving soil health and reducing the import bill for synthetic fertilizers.11 2.2 PM-PRANAM (Restoration, Awareness, Nourishment and Amelioration of Mother Earth) PM-PRANAM represents a novel experiment in fiscal federalism. Rather than a direct subsidy scheme, it is an incentive mechanism designed to nudge states toward balanced fertilizer use.14 2.2.1 The Subsidy Savings Mechanism The scheme does not have a separate budget; it is financed through the savings generated from the reduction in the existing fertilizer subsidy bill. Baseline Calculation: A states reduction in chemical fertilizer consumption (Urea, DAP, NPK, MOP) is measured against its average consumption over the previous three years.15 Grant Allocation: The Centre passes on 50 of the subsidy savings to the state as a grant.15 For example, if a state saves 3,000 crore in subsidies by reducing consumption, the Centre transfers 1,500 crore back to the state.17 Fund Utilization: The state",
    "DAP, NPK, MOP) is measured against its average consumption over the previous three years.15 Grant Allocation: The Centre passes on 50 of the subsidy savings to the state as a grant.15 For example, if a state saves 3,000 crore in subsidies by reducing consumption, the Centre transfers 1,500 crore back to the state.17 Fund Utilization: The state must utilize the grant in a 70:30 ratio: 70 for asset creation (technological adoption, alternative fertilizer production units). 30 for rewarding farmers, panchayats, and self-help groups (SHGs) who contributed to the reduction.14 Monitoring: The Integrated Fertilizers Management System (iFMS) dashboard tracks consumption data in real-time to calculate eligibility.14 2.3 National Bamboo Mission (NBM) Restructured to treat bamboo as a specialized crop (Green Gold), the mission aims to link farmers to markets. 2.3.1 Funding and 2026 Deliverables Funding Pattern: 60:40 (Centre:State) for general states, and 90:10 for North Eastern Hilly states. 2026 Targets: The missions outcome indicators for June 2026 include the establishment of bamboo product trading centres in seven forest zones and a marketing information system to formalize the trade.18 This moves the sector from unorganized artisanal work to a structured agro-industry. 3. Ecological Restoration: Forests, Wetlands, and Carbon Sinks Moving beyond industrial decarbonization, the governments 2026 agenda places heavy emphasis on the restoration of natural ecosystems to act as carbon sinks and biodiversity refuges. 3.1 Nagar Van Yojana (Urban Forest Scheme) As urbanization accelerates, the Nagar Van Yojana aims to create urban lungs within city limits. 3.1.1 Strategic Expansion Target: The scheme initially targeted 400 Nagar Vans by 2025 but has been expanded to develop 1,000 Nagar Vans by 2027.19 Scope: Projects cover cities with Municipal Corporations, Councils, and ULBs. A typical Nagar Van ranges from 10 hectares to 50 hectares.21 3.1.2 Funding Mechanics via CAMPA The scheme is funded through the National Compensatory",
    "city limits. 3.1.1 Strategic Expansion Target: The scheme initially targeted 400 Nagar Vans by 2025 but has been expanded to develop 1,000 Nagar Vans by 2027.19 Scope: Projects cover cities with Municipal Corporations, Councils, and ULBs. A typical Nagar Van ranges from 10 hectares to 50 hectares.21 3.1.2 Funding Mechanics via CAMPA The scheme is funded through the National Compensatory Afforestation Fund Management and Planning Authority (CAMPA). Grant Norms: The Ministry provides a one-time grant of 4 lakh per hectare for fencing, soil conservation, and plantation activities.21 Cap: The maximum grant is capped at 2 crore per Nagar Van.22 Operational Flow: Funds flow from the National Authority to State Forest Development Agencies (SFDAs). The release is typically tranched (e.g., 70 initially), contingent on utilization certificates.22 Components: Beyond trees, the scheme funds biodiversity parks, Smriti Vans (memorial forests), butterfly conservatories, and herbal gardens, turning these forests into centers for environmental education.21 3.2 National Mission for a Green India (GIM) One of the eight missions under the NAPCC, GIM focuses on the quality of forest cover, not just quantity. 3.2.1 Landscape Approach Objective: To improve foresttree cover on 5 million hectares and improve quality on another 5 million hectares. Carbon Sink Goal: Sequestering an additional 2.5 to 3.0 billion tonnes of CO2 equivalent by 2030.23 Convergence: GIM relies heavily on convergence with MGNREGS (for labor) and CAMPA (for material) to maximize per-hectare investment. The mission utilizes a bottom-up approach where Joint Forest Management Committees (JFMCs) draft micro-plans.24 Budget: The total estimated cost for the 10-year period (2021-30) is 12,190 crore.23 3.3 MISHTI (Mangrove Initiative for Shoreline Habitats and Tangible Incomes) Launched to protect coastal communities from climate disasters, MISHTI focuses on mangrove reforestation. 3.3.1 Operational Details Target: Plantation of mangroves over 540 sq. km across 11 States and 2 Union",
    "Forest Management Committees (JFMCs) draft micro-plans.24 Budget: The total estimated cost for the 10-year period (2021-30) is 12,190 crore.23 3.3 MISHTI (Mangrove Initiative for Shoreline Habitats and Tangible Incomes) Launched to protect coastal communities from climate disasters, MISHTI focuses on mangrove reforestation. 3.3.1 Operational Details Target: Plantation of mangroves over 540 sq. km across 11 States and 2 Union Territories.25 Funding Model: A convergence model where the Centre bears 80 of the cost and State Governments bear 20.25 Tangible Incomes: The scheme explicitly links conservation to livelihoods. It promotes aquaculture (e.g., crab farming) and eco-tourism within mangrove ecosystems to give local communities a financial stake in their protection.26 Status in 2026: States like Gujarat have already planted 190 sq. km, emerging as leaders in implementation.25 3.4 Amrit Dharohar Scheme This scheme targets the conservation of Ramsar Sites (wetlands of international importance). 3.4.1 Duration and Key Pillars Timeline: The scheme is implemented for three years, concluding in June 2026.27 Pillars: 1. Species Conservation: Developing biodiversity inventories. 2. Nature Tourism: Shifting from mass tourism to high-value nature tourism. Training local youth as nature guides is a core activity.28 3. Wetlands Carbon: Establishing protocols to measure and inventory the carbon stock of wetlands, paving the way for future carbon credit generation from these ecosystems.27 4. Market Mechanisms: Pricing Pollution and Ecology In 2026, Indias environmental policy has matured to include sophisticated market-based instruments. 4.1 Carbon Credit Trading Scheme (CCTS) The CCTS establishes a mandatory domestic carbon market, transitioning from the earlier Perform, Achieve, and Trade (PAT) scheme. 4.1.1 Compliance Mechanism Obligated Entities: By 2026, the scheme covers 490 entities across hard-to-abate sectors. Initially covering cement, steel, and aluminum, it has expanded to include Textiles, Petroleum Refineries,",
    "sophisticated market-based instruments. 4.1 Carbon Credit Trading Scheme (CCTS) The CCTS establishes a mandatory domestic carbon market, transitioning from the earlier Perform, Achieve, and Trade (PAT) scheme. 4.1.1 Compliance Mechanism Obligated Entities: By 2026, the scheme covers 490 entities across hard-to-abate sectors. Initially covering cement, steel, and aluminum, it has expanded to include Textiles, Petroleum Refineries, Petrochemicals, and Secondary Aluminum.29 Targets: Greenhouse Gas Emission Intensity (GEI) targets are notified for compliance years 2025-26 and 2026-27. Trading: Entities that overachieve their targets earn Carbon Credit Certificates (CCCs). Those who fail must purchase CCCs from the market. Banking: Unlimited banking of credits is allowed to provide flexibility, but borrowing from future years is prohibited.31 Regulator: The Bureau of Energy Efficiency (BEE) acts as the administrator, while the Central Electricity Regulatory Commission (CERC) regulates the trading on power exchanges.31 4.2 Green Credit Programme (GCP) Distinct from CCTS, the GCP is a voluntary mechanism incentivizing environmentally positive actions. 4.2.1 Voluntary Market Design Scope: It covers activities like tree plantation, water conservation, sustainable agriculture, and waste management. Compensatory Afforestation (CA): A critical application in 2026 is the use of Green Credits for CA compliance. Project developers (e.g., highways, mines) can purchase Green Credits generated from afforestation projects to meet their legal obligations for forest diversion. This creates a land bank of degraded forest land available for restoration by private and public entities.32 Administrator: The Indian Council of Forestry Research and Education (ICFRE) manages the Green Credit Registry.34 5. Human Capital: Skilling for the Green Economy A net-zero economy requires a net-zero workforce. The Ministry of Skill Development and Entrepreneurship (MSDE) has aligned its flagship schemes to this reality. 5.1 Pradhan Mantri Kaushal Vikas Yojana",
    "and public entities.32 Administrator: The Indian Council of Forestry Research and Education (ICFRE) manages the Green Credit Registry.34 5. Human Capital: Skilling for the Green Economy A net-zero economy requires a net-zero workforce. The Ministry of Skill Development and Entrepreneurship (MSDE) has aligned its flagship schemes to this reality. 5.1 Pradhan Mantri Kaushal Vikas Yojana (PMKVY) The PMKVY has evolved through multiple iterations to address the skills gap. 5.1.1 PMKVY 4.0 (FY 2022-26) Paradigm Shift: Moving away from classroom-based training, PMKVY 4.0 emphasizes On-Job Training (OJT). It partners with industries to train candidates on the shop floor, ensuring relevance.35 Green Jobs: The scheme includes specialized course modules for green roles. Status: It continues to enroll candidates in 2026, with a focus on clearing the backlog of certifications and ensuring placement linkage.35 5.1.2 PMKVY 5.0 (2026 Onwards) Future Outlook: While not fully launched, snippets indicate PMKVY 5.0 will focus heavily on Industry 4.0 and high-end tech skills (AI for Energy, Green Hydrogen handling) to support the NGHM and PLI schemes.36 5.2 Skill Council for Green Jobs (SCGJ) The SCGJ is the nodal body for defining the curriculum for the green transition. 5.2.1 Qualification Packs (QPs) Active in 2026 The SCGJ has developed and standardized training for specific roles: Solar: Solar PV Installer (Suryamitra) (SGJQ0101), Rooftop Solar Grid Engineer (SGJQ0106). Waste Management: E-Waste Recycling Entrepreneur (SGJQ0202), Waste Optimization Professional.37 Clean Cooking: Improved Cookstove Installer (SGJQ2101). Hydrogen: New QPs are being rolled out for hydrogen handling and safety protocols.39 5.3 Inclusive Skilling: Jan Shikshan Sansthan (JSS) Focus: Vocational training for non-literates and school dropouts in rural areas. Digital Integration: In 2026, JSS has integrated Digital Financial Literacy into its curriculum. This ensures that beneficiaries (e.g., self-employed tailors or food processors) can use digital payments and",
    "New QPs are being rolled out for hydrogen handling and safety protocols.39 5.3 Inclusive Skilling: Jan Shikshan Sansthan (JSS) Focus: Vocational training for non-literates and school dropouts in rural areas. Digital Integration: In 2026, JSS has integrated Digital Financial Literacy into its curriculum. This ensures that beneficiaries (e.g., self-employed tailors or food processors) can use digital payments and access credit, bridging the digital divide.40 Reach: 289 JSS units operate across the country, with over 82 female beneficiaries.41 5.4 Deen Dayal Upadhyaya Grameen Kaushalya Yojana (DDU-GKY) Status: Information indicates that DDU-GKY is undergoing a transition or restructuring in 2026, with some programs postponed or legacy data being migrated to new portals (Kaushal Bharat). This suggests a consolidation phase before a potential relaunch or merger with newer skilling missions.42 6. Green Entrepreneurship and Financing To catalyze innovation, the government provides specific financial instruments for green startups and MSMEs. 6.1 MSME Green Financing Schemes The Ministry of MSME and SIDBI run targeted schemes to lower the cost of capital for green projects. 6.1.1 MSE-GIFT (Green Investment and Financing for Transformation) Objective: To help MSMEs adopt green technologies (e.g., solar rooftops, energy-efficient machinery). Incentive: It offers Interest Subvention of 2 per annum for 5 years on term loans up to 2 crores. Risk Sharing: A risk-sharing facility (RSF) covers collateral-free loans, encouraging banks to lend to perceived risky green projects.44 6.1.2 MSE-SPICE (Scheme for Promotion and Investment in Circular Economy) Focus: Circular economy projects like recycling units or waste-to-energy plants. Mechanism: It provides a capital subsidy (typically 25) to reduce the payback period for these capital-intensive projects. The scheme is operational until 2026-27 with an outlay of approx. 478 crore.45 6.2 Startup India Seed Fund Scheme (SISFS) Relevance: While sector-agnostic, the scheme prioritizes green",
    "Investment in Circular Economy) Focus: Circular economy projects like recycling units or waste-to-energy plants. Mechanism: It provides a capital subsidy (typically 25) to reduce the payback period for these capital-intensive projects. The scheme is operational until 2026-27 with an outlay of approx. 478 crore.45 6.2 Startup India Seed Fund Scheme (SISFS) Relevance: While sector-agnostic, the scheme prioritizes green startups. Funding: Grants of up to 20 lakhs for proof of concept and up to 50 lakhs for commercialization via convertible debentures. This early-stage capital is crucial for hardware-heavy green tech startups.47 6.3 TIDE 2.0 (Technology Incubation and Development of Entrepreneurs) Managed by: MeitY (Ministry of Electronics and IT). Thematic Area: Environment and Clean Tech is a core theme. Support: It supports startups using emerging tech (IoT, AI, Blockchain) for environmental solutions. Grants (EiR up to 4 Lakhs, Grant up to 7 Lakhs) are disbursed through 51 incubators.48 7. Cooperative Federalism: State-Specific Initiatives States are implementing central mandates with their own top-up incentives, creating a competitive environment for green investment. 7.1 Uttar Pradesh: Green Hydrogen Policy Capital Subsidy: UP offers a massive capital subsidy of up to 40 for the first 5 projects (capped at 225 Cr) and 30 for subsequent ones. Land: Government land provided at nominal rates (1acreyear for PSUs). Power: 100 exemption on electricity duty and transmission charges for 10 years.50 7.2 Gujarat: Renewable Energy Leadership Surya Ghar Success: Gujarat leads in rooftop solar, driven by the Surya Ghar scheme. The state provides a seamless digital experience for subsidy disbursement. Land Policy: The state facilitates mega-parks (e.g., Khavda) with streamlined allotment. Subsidy: Fixed subsidies per kW (e.g., 30,000kW for small systems) are directly credited to beneficiaries.51 7.3 Tamil Nadu: Circular Economy Investment Policy 2026 Focus: Recycling-based industries (textile, auto, e-waste). Incentives: 10 capital",
    "by the Surya Ghar scheme. The state provides a seamless digital experience for subsidy disbursement. Land Policy: The state facilitates mega-parks (e.g., Khavda) with streamlined allotment. Subsidy: Fixed subsidies per kW (e.g., 30,000kW for small systems) are directly credited to beneficiaries.51 7.3 Tamil Nadu: Circular Economy Investment Policy 2026 Focus: Recycling-based industries (textile, auto, e-waste). Incentives: 10 capital subsidy on fixed assets (capped at 3 crore) and payroll subsidies for green jobs. Infrastructure: SIPCOT is developing low-carbon industrial parks with shared recycling infrastructure.53 8. Conclusion The year 2026 marks the maturation of Indias sustainability policy. The transition from announcement to implementation is visible across all sectors. Energy: The NGHM and PM-KUSUM are actively building the physical infrastructure for a post-fossil fuel economy. Ecology: MISHTI and Nagar Van are institutionalizing the value of natural capital. Economy: CCTS and PM-PRANAM are successfully utilizing market mechanisms and fiscal federalism to price externalities and incentivize behavioral change. People: PMKVY and SCGJ ensure that the Indian workforce is not left behind in this transition. For stakeholdersinvestors, policymakers, and entrepreneursthe roadmap is clear: the Indian state has aligned its considerable fiscal and regulatory power behind the green transition, creating a stable, long-term environment for sustainable growth. List of Tables Table 1: Funding Allocation for National Green Hydrogen Mission Pilot Projects Sector Allocation ( Crore) Active Period Objective Low Carbon Steel 455 Up to 2029-30 Replacement of coking coal with H2 in DRI Mobility 496 Up to 2025-26 Heavy-duty trucking inter-city buses Shipping 115 Up to 2025-26 Green Ammonia bunkers retrofitting Total Pilot Outlay 1,466 Table 2: Financial Assistance Norms for Key Afforestation Schemes Scheme Grant Norm Funding Source 202627 Target Nagar Van Yojana 4 Lakh Hectare CAMPA 1,000 Urban Forests MISHTI 80:20 (Centre:State)",
    "coking coal with H2 in DRI Mobility 496 Up to 2025-26 Heavy-duty trucking inter-city buses Shipping 115 Up to 2025-26 Green Ammonia bunkers retrofitting Total Pilot Outlay 1,466 Table 2: Financial Assistance Norms for Key Afforestation Schemes Scheme Grant Norm Funding Source 202627 Target Nagar Van Yojana 4 Lakh Hectare CAMPA 1,000 Urban Forests MISHTI 80:20 (Centre:State) MGNREGS CAMPA 540 sq. km Mangroves Green India Mission Varies by Intervention GIM Budget Quality improvement of 5M ha Table 3: PM-KUSUM Component Breakdown Component Description Incentive CFA Component A Decentralized Solar (GroundStilt) PPA with DISCOM (Feed-in Tariff) Component B Off-grid Solar Pumps 30 Centre 30 State Subsidy Component C Grid-connected Pumps (Solarization) 30 CFA; Surplus power sale to Grid Table 4: Key Green Skill Qualification Packs (SCGJ) Job Role Code Focus Area Solar PV Installer (Suryamitra) SGJQ0101 Installation Maintenance Rooftop Solar Grid Engineer SGJQ0106 Grid Integration Safety E-Waste Recycling Entrepreneur SGJQ0202 Circular Economy Business Improved Cookstove Installer SGJQ2101 Clean Cooking Solutions Works cited 1. National Green Hydrogen Mission MINISTRY OF NEW AND RENEWABLE ENERGY India, accessed on January 23, 2026, https:mnre.gov.inennational-green-hydrogen-mission 2. National Green Hydrogen Mission - NSWS, accessed on January 23, 2026, https:www.nsws.gov.inportalschemegreenhydrogenpolicy 3. NATIONAL GREEN HYDROGEN MISSION - Principal Scientific Adviser, accessed on January 23, 2026, https:psa.gov.inCMSwebsitesdefaultfilespublicationGreen20Hydrogen2 0Mission_Jan20202320by20MNRE.pdf 4. BIRAC-Call For Proposal, accessed on January 23, 2026, https:birac.nic.incfp_view.php?id116scheme_type52 5. Pradhan Mantri Kisan Urja Suraksha evam Utthaan Mahabhiyaan (PM KUSUM) MINISTRY OF NEW AND RENEWABLE ENERGY, accessed on January 23, 2026, https:mnre.gov.inenpradhan-mantri-kisan-urja-suraksha-evam-utthaan-maha bhiyaan-pm-kusum 6. PM-KUSUM Yojana - Solar Energy Scheme - IBEF, accessed on January 23, 2026,",
    "2026, https:psa.gov.inCMSwebsitesdefaultfilespublicationGreen20Hydrogen2 0Mission_Jan20202320by20MNRE.pdf 4. BIRAC-Call For Proposal, accessed on January 23, 2026, https:birac.nic.incfp_view.php?id116scheme_type52 5. Pradhan Mantri Kisan Urja Suraksha evam Utthaan Mahabhiyaan (PM KUSUM) MINISTRY OF NEW AND RENEWABLE ENERGY, accessed on January 23, 2026, https:mnre.gov.inenpradhan-mantri-kisan-urja-suraksha-evam-utthaan-maha bhiyaan-pm-kusum 6. PM-KUSUM Yojana - Solar Energy Scheme - IBEF, accessed on January 23, 2026, https:www.ibef.orggovernment-schemespm-kusum-yojana 7. Amendment in the PM-KUSUM Scheme to ease implementation inter-alia include - PIB, accessed on January 23, 2026, https:www.pib.gov.inPressReleaseIframePage.aspx?PRID1907703 8. PM-KUSUM Scheme: Extended to 2026, Empowering Farmers with Solar Power - Karma AI, accessed on January 23, 2026, https:karma.lawinsightslaw-librarypm-kusum-scheme-extended-to-2026-em powering-farmers-with-solar-power 9. Schemes MINISTRY OF NEW AND RENEWABLE ENERGY India, accessed on January 23, 2026, https:mnre.gov.inenpolicies-and-regulationsschemes-and-guidelinesscheme s 10.About-Us GOBARdhan Unified Registration Portal - Swachh Bharat Mission, accessed on January 23, 2026, https:gobardhan.sbm.gov.inabout-us 11.GOBARdhan Scheme Crosses 500 Biogas Plants Milestone, CBG Push Gathers Pace, accessed on January 23, 2026, https:www.republicworld.combusinessgobardhan-scheme-crosses-500-biog as-plants-milestone-cbg-push-gathers-pace 12.GOBARdhan Unified Registration Portal, accessed on January 23, 2026, https:gobardhan.eil.co.inimportant-circular 13.Direct Pipeline Infrastructure (DPI): - About the Scheme for CGD Connectivity, accessed on January 23, 2026, https:dpi.eil.co.inDPI-About20the20Scheme.pdf 14.PM-PRANAM Scheme - Drishti IAS, accessed on January 23, 2026, https:www.drishtiias.comdaily-updatesdaily-news-analysispm-pranam-schem e-1 15.GOVERNMENT OF INDIA MINISTRY OF CHEMICALS AND FERTILIZERS DEPARTMENT OF FERTILIZERS RAJYA SABHA UNSTARRED QUESTION NO. 2573 TO, accessed on",
    "CGD Connectivity, accessed on January 23, 2026, https:dpi.eil.co.inDPI-About20the20Scheme.pdf 14.PM-PRANAM Scheme - Drishti IAS, accessed on January 23, 2026, https:www.drishtiias.comdaily-updatesdaily-news-analysispm-pranam-schem e-1 15.GOVERNMENT OF INDIA MINISTRY OF CHEMICALS AND FERTILIZERS DEPARTMENT OF FERTILIZERS RAJYA SABHA UNSTARRED QUESTION NO. 2573 TO, accessed on January 23, 2026, https:sansad.ingetFileannex268AU2573_TNgWHm.pdf?sourcepqars 16.PM Pranam Scheme: Details and Key Feature Explained - Swipe, accessed on January 23, 2026, https:getswipe.inblogarticlepm-pranam-scheme-key-features-and-eligibility- details 17.About PM-PRANAM Legacy IAS Academy, accessed on January 23, 2026, https:www.legacyias.comabout-pm-pranam 18.NATIONAL BAMBOO DEVELOPMENT STRATEGY AND ACTION PLAN 2023 2031, accessed on January 23, 2026, https:faolex.fao.orgdocspdftan231737.pdf 19.Nagar Van Yojana Scheme Objectives, Key Features, Benefits - PWOnlyIAS, accessed on January 23, 2026, https:pwonlyias.comnagar-van-yojana 20.OIH GOVERNMENT OF INDIA MINISTRY OF ENVIRONMENT, FOREST AND CLIMATE CHANGE LOK SABHA UNSTARRED QUESTION NO. 2578 TO BE ANSWERED, accessed on January 23, 2026, https:sansad.ingetFileloksabhaquestionsannex184AU2578_Dv7Ba3.pdf?sourc epqals 21.Nagar Van Yojana, Objectives, Key Features, Significance - Physics Wallah, accessed on January 23, 2026, https:www.pw.liveupscexamsnagar-van-yojana 22.documentation of achievements under nagar van yojana - Environment, Forests Climate Change Department, accessed on January 23, 2026, https:forest.mizoram.gov.inuploadsattachments20250864e0f98c3253d3474 985e90e6d981b7bpart-i-1-21.pdf 23.National Mission for a GREEN INDIA - Ministry of Environment, Forest and Climate Change, accessed on January 23, 2026, https:moef.gov.inuploads201708Revised20Mission20Document.pdf 24.Revised Green India Mission - PMF IAS, accessed on January 23, 2026, https:www.pmfias.comrevised-green-india-mission 25.Mangrove Afforestation MISHTI Scheme Environmental Conservation Coastal Livelihoods",
    "23.National Mission for a GREEN INDIA - Ministry of Environment, Forest and Climate Change, accessed on January 23, 2026, https:moef.gov.inuploads201708Revised20Mission20Document.pdf 24.Revised Green India Mission - PMF IAS, accessed on January 23, 2026, https:www.pmfias.comrevised-green-india-mission 25.Mangrove Afforestation MISHTI Scheme Environmental Conservation Coastal Livelihoods Gujarat Government - IAS Gyan, accessed on January 23, 2026, https:www.iasgyan.indaily-current-affairsmishti 26.National Level Workshop on MISHTI Held in Vijayawada, Andhra Pradesh - PIB, accessed on January 23, 2026, https:www.pib.gov.inPressReleasePage.aspx?PRID22127603lang1 27.Amrit Dharohar - Wetlands of India Portal, accessed on January 23, 2026, https:indianwetlands.inwp-contentuploadslibrary1686133937.pdf 28.Amrit Dharohar Capacity Building Scheme - Drishti IAS, accessed on January 23, 2026, https:www.drishtiias.comdaily-updatesdaily-news-analysisamrit-dharohar-cap acity-building-scheme 29.India Expands Greenhouse Gas Emission Intensity Targets Under Carbon Credit Trading Scheme - CCarbon, accessed on January 23, 2026, https:www.ccarbon.infonewsindia-expands-greenhouse-gas-emission-intensit y-targets-under-carbon-credit-trading-scheme 30.Govt adds 4 new sectors to mandatory greenhouse gas reduction regime, accessed on January 23, 2026, https:auto.economictimes.indiatimes.comnewsindustrygovt-adds-4-new-sect ors-to-mandatory-greenhouse-gas-reduction-regime126768484 31.Indian Carbon Credit Trading Scheme - International Carbon Action Partnership (ICAP), accessed on January 23, 2026, https:icapcarbonaction.comenetsindian-carbon-credit-trading-scheme 32.Green Credit Programme - moefcc-gcp.in, accessed on January 23, 2026, https:www.moefcc-gcp.inaboutaboutGCP 33.The Green Credit Rules: Unlocking Sustainable Growth - GCESCJ, accessed on January 23, 2026, https:www.gcescj.inpostthe-green-credit-rules-unlocking-sustainable-growth 34.Registry Guidelines - moefcc-gcp.in, accessed on January 23, 2026,",
    "2026, https:icapcarbonaction.comenetsindian-carbon-credit-trading-scheme 32.Green Credit Programme - moefcc-gcp.in, accessed on January 23, 2026, https:www.moefcc-gcp.inaboutaboutGCP 33.The Green Credit Rules: Unlocking Sustainable Growth - GCESCJ, accessed on January 23, 2026, https:www.gcescj.inpostthe-green-credit-rules-unlocking-sustainable-growth 34.Registry Guidelines - moefcc-gcp.in, accessed on January 23, 2026, https:www.moefcc-gcp.inregistryguidelines 35.guidelines for pradhan mantri kaushal vikas yojana 4.0 - Ministry of Skill Development and Entrepreneurship, accessed on January 23, 2026, https:www.msde.gov.instaticuploads202402PMKVY-4.0-Guidelines_final-co py.pdf 36.Pradhan Mantri Kaushal Vikas Yojana (PMKVY): Empowering Indias Skilled Workforce, accessed on January 23, 2026, https:www.skillreporter.comschemespmkvypradhan-mantri-kaushal-vikas-yoj ana-pmkvy-pmkvy-5-0 37.Green Skill Development Programs (GSDP) - EPTRI, accessed on January 23, 2026, https:eptri.telangana.gov.ingspd 38.Skill Council for Green Jobs - National Skill Development Corporation (NSDC), accessed on January 23, 2026, https:nsdcindia.orgnos-listing39 39.SCGJ Welcome to SCGJ SKILL COUNCIL for GREEN JOBS Skill, Solar , Suryamitra, Green Jobs, Skill India, PMKVY, NSDC, Renewable, Capacity Builiding, Swachh Bharat, National Solar Mission, Wind Energy, Waste Management, Training, Asssessment, QP, Qualification Packs, Sustainable, Environment, SDGs, accessed on January 23, 2026, https:sscgj.in 40.MSDE to Organise Jan Shikshan Sansthan Zonal Conference and Stakeholder Consultation in Pune on 19-20 January 2026 - PIB, accessed on January 23, 2026, https:www.pib.gov.inPressReleasePage.aspx?PRID2215780 41.Jan Shikshan Sansthan (JSS) - Ministry of Skill Development and Entrepreneurship, accessed on January 23, 2026, https:xn--o1bna6ezc1cxc.xn--11b7cb3a6a.xn--h2brj9cofferingsschemes-and-s ervicesdetailsjan-shikshan-sansthan-jss-cjM4ATMtQWa 42.DDU-GKY State Wise Details - Kaushal Bharat, accessed on January 23, 2026,",
    "19-20 January 2026 - PIB, accessed on January 23, 2026, https:www.pib.gov.inPressReleasePage.aspx?PRID2215780 41.Jan Shikshan Sansthan (JSS) - Ministry of Skill Development and Entrepreneurship, accessed on January 23, 2026, https:xn--o1bna6ezc1cxc.xn--11b7cb3a6a.xn--h2brj9cofferingsschemes-and-s ervicesdetailsjan-shikshan-sansthan-jss-cjM4ATMtQWa 42.DDU-GKY State Wise Details - Kaushal Bharat, accessed on January 23, 2026, https:kaushalbharat.gov.inddugky-reportcandidateview 43.DDUGKY, accessed on January 23, 2026, http:ddugky.info 44.Green MSME Portal: Home Page, accessed on January 23, 2026, https:green.msme.gov.in 45.Scheme Guidelines - DCMSME, accessed on January 23, 2026, https:www.dcmsme.gov.inCLCS_TUS_SchemeGIFTsMSE_GIFT20_Scheme_ Operating_Guidelines.pdf 46.MSME SPICE Guidelines - MOEFCC, accessed on January 23, 2026, https:suppwmdashboard.inuploadscontent_managerMSE_SPICE_English.pdf 47.Startup India Seed Fund Scheme (SISFS), accessed on January 23, 2026, https:seedfund.startupindia.gov.in 48.A Decade of Startup India - PIB, accessed on January 23, 2026, https:www.pib.gov.inPressReleasePage.aspx?PRID22148723lang1 49.MeitY TIDE 2.0 GrantSeed Fund at AIC Banasthali (For Women Entrepreneurs), accessed on January 23, 2026, https:www.startupgrantsindia.commeity-tide-2-0-grant-seed-fund-aic-banast hali-women-entrepreneurs-180 50.Green Hydrogen Policy Official Website of Invest UP, Government of Uttar Pradesh, India, accessed on January 23, 2026, https:invest.up.gov.ingreen-hydrogen-policy 51.Subsidized Rooftop Solar Systems, accessed on January 23, 2026, https:www.trendhunter.comtrendsstate-of-gujarat 52.Solar in Gujarat: Potential, Solar Policy and Subsidy (2025), accessed on January 23, 2026, https:ornatesolar.comblogpotential-of-solar-power-in-gujarat 53.TN circular economy policy to give push to recycling industries, accessed on January 23, 2026, https:www.newindianexpress.comstatestamil-nadu2026Jan20tn-circular-ec onomy-policy-to-give-push-to-recycling-industries The 2026 India Sustainability",
    "2026, https:www.trendhunter.comtrendsstate-of-gujarat 52.Solar in Gujarat: Potential, Solar Policy and Subsidy (2025), accessed on January 23, 2026, https:ornatesolar.comblogpotential-of-solar-power-in-gujarat 53.TN circular economy policy to give push to recycling industries, accessed on January 23, 2026, https:www.newindianexpress.comstatestamil-nadu2026Jan20tn-circular-ec onomy-policy-to-give-push-to-recycling-industries The 2026 India Sustainability Skilling Masterfile: Active Government Schemes, Data Direct Links Document Status: Live Active for FY 2025-26 Coverage: Central Sector Centrally Sponsored Schemes Purpose: Training Data for LLM Reference for Policymakers Entrepreneurs 1. Sustainability Energy Transition Schemes focused on renewable energy, waste-to-wealth, and carbon reduction. 1.1. PM-Surya Ghar: Muft Bijli Yojana This is the flagship residential solar scheme for 2026, targeting 1 crore households. Objective: Provide free electricity (up to 300 units) via rooftop solar and allow selling of surplus power. Subsidy Structure (2026): 1 kW System: 30,000 subsidy. 2 kW System: 60,000 subsidy. 3 kW System: 78,000 subsidy (Fixed cap for systems 3 kW). Financing: Collateral-free loans available at Repo Rate 0.5 (approx. 7). Official Portal: suspicious link removed 1.2. PM E-DRIVE (PM Electric Drive Revolution in Innovative Vehicle Enhancement) Replacing the FAME-II scheme, PM E-DRIVE is the active mobility scheme valid until March 31, 2026. Outlay: 10,900 Crore. Incentives (e-Vouchers): e-2W (Two Wheelers): 2,500 - 5,000 per kWh of battery capacity. Cap: 10,000vehicle. e-3W (Three Wheelers): 5,000 per kWh. Targeted at commercial autorickshaws. e-Trucks: Incentives for scrapping old trucks and buying electric ones. e-Buses: 4,391 Cr allocated for public transport agencies. Official Portal: https:pmedrive.heavyindustries.gov.in 1.3. National Green Hydrogen Mission (NGHM) Program Name: SIGHT (Strategic Interventions for Green Hydrogen Transition). Objective: Production of 5 Million Metric Tonnes",
    "5,000 per kWh. Targeted at commercial autorickshaws. e-Trucks: Incentives for scrapping old trucks and buying electric ones. e-Buses: 4,391 Cr allocated for public transport agencies. Official Portal: https:pmedrive.heavyindustries.gov.in 1.3. National Green Hydrogen Mission (NGHM) Program Name: SIGHT (Strategic Interventions for Green Hydrogen Transition). Objective: Production of 5 Million Metric Tonnes (MMT) of Green Hydrogen by 2030. Financial Incentives: Component I: Incentives for domestic Electrolyser Manufacturing (4,440 Cr). Component II: Direct subsidy for Green Hydrogen Production (13,050 Cr). Pilot Projects: Funding available for using Green Hydrogen in Steel (455 Cr), Shipping (115 Cr), and Transport (496 Cr). Official Portal: https:nghm.mnre.gov.in 1.4. GOBARdhan (Galvanizing Organic Bio-Agro Resources Dhan) Focus: Converting cattle dungagri-waste into BiogasCBG (Compressed Biogas). Key Benefit: Market Development Assistance (MDA) of 1,500 per MT for the sale of Fermented Organic Manure (FOM) produced from biogas plants. Support: Financial assistance of up to 50 Lakh per district for community clusters. Official Portal: https:gobardhan.sbm.gov.in 1.5. PM-PRANAM Full Name: Programme for Restoration, Awareness, Nourishment and Amelioration of Mother Earth. Mechanism: Incentivizes States to reduce chemical fertilizer usage. 50 of the subsidy savings are passed back to the State as a grant. Usage: States use these funds to create assets for organic farming and alternative fertilizers. Link (Dept of Fertilizers): https:fert.nic.in 2. Green Skill Development Specialized technical training for the green economy. 2.1. Green Skill Development Programme (GSDP) Managed by the Ministry of Environment, Forest Climate Change (MoEFCC) utilizing ENVIS Hubs. Target: Skilling youth in environment and forest sectors for employmentself-employment. Active Courses (2026): Pollution Monitors (AirWaterSoil). Effluent Treatment Plant (ETPSTP) Operation. Waste Management Specialists. Bamboo Crafts Livelihood. Parataxonomy",
    "technical training for the green economy. 2.1. Green Skill Development Programme (GSDP) Managed by the Ministry of Environment, Forest Climate Change (MoEFCC) utilizing ENVIS Hubs. Target: Skilling youth in environment and forest sectors for employmentself-employment. Active Courses (2026): Pollution Monitors (AirWaterSoil). Effluent Treatment Plant (ETPSTP) Operation. Waste Management Specialists. Bamboo Crafts Livelihood. Parataxonomy (Biodiversity identification). Official Portal: http:gsdp-envis.gov.in 2.2. Suryamitra Skill Development Programme Implementation: National Institute of Solar Energy (NISE). Course Details: 600-hour residential training for ITIDiploma holders to become Solar PV Installers. Employment: Mandatory for vendors under PM-Surya Ghar to employ certified Suryamitras. Official Portal: https:suryamitra.nise.res.in 2.3. Skill Council for Green Jobs (SCGJ) Initiatives Role: The awarding body for green certifications. Key Qualification Packs (QPs): Green Hydrogen Technician. Solar Proposal Evaluation Specialist. Improved Cookstove Installer. Agri-Residue Aggregator (Biomass). Official Portal: https:sscgj.in 3. Skill Development (Financial, Technical, Leadership) Broader human capital schemes with specific components for inclusion and leadership. 3.1. Pradhan Mantri Kaushal Vikas Yojana (PMKVY) 4.0 Focus: Industry 4.0, On-the-Job Training (OJT), and codingAI skills. Components: Short Term Training (STT): 200-600 hours for fresh skilling. Recognition of Prior Learning (RPL): Certification for workforce with existing skills. Financial Norms: Base training cost 49hour (Category I trades). Payouts linked to certification and placement. Official Portal: https:www.skillindiadigital.gov.in 3.2. National Apprenticeship Promotion Scheme (NAPS 2.0) Objective: Promoting apprenticeship by sharing cost with employers. Financial Benefit: Govt shares 25 of the stipend payable to the apprentice, capped at 1,500 per month. Mechanism: Direct Benefit Transfer (DBT) to the apprentices bank account. Official Portal:",
    "and placement. Official Portal: https:www.skillindiadigital.gov.in 3.2. National Apprenticeship Promotion Scheme (NAPS 2.0) Objective: Promoting apprenticeship by sharing cost with employers. Financial Benefit: Govt shares 25 of the stipend payable to the apprentice, capped at 1,500 per month. Mechanism: Direct Benefit Transfer (DBT) to the apprentices bank account. Official Portal: https:www.apprenticeshipindia.gov.in 3.3. Financial Literacy Initiatives (RBINCFE) National Centre for Financial Education (NCFE): Implements the Financial Education Programme for Adults (FEPA) targeting farmers, SHGs, and rural youth. Centre for Financial Literacy (CFL): Pilot project by RBINABARD to set up literacy centers at the block level. RBI Financial Literacy Week 2026: Theme focused on Financial Literacy - Womens Prosperity (Feb 2026). Official Portal: https:ncfe.org.in 3.4. Rashtriya Yuva Sashaktikaran Karyakram (RYSK) Objective: Leadership development for youth (15-29 years). Components: National Youth Corps (NYC): Volunteers deployed for nation-building activities (Honorarium 5000mo). National Young Leaders Programme (NYLP): Leadership training, Shramadaan (voluntary labour), and community service. Official Portal: https:yas.nic.in 3.5. PM VIKAS (Pradhan Mantri Virasat Ka Samvardhan) Target: Minorities and Artisan communities. Leadership Component: Women Leadership and Entrepreneurship tracks to train minority women in business management and leadership roles. Official Portal: https:pmvikas.minorityaffairs.gov.in 4. Afforestation Plantation Schemes for ecological restoration and carbon sinks. 4.1. Nagar Van Yojana (Urban Forests) Target: Creation of 1,000 Nagar Vans by 2027. Funding: Paid from CAMPA funds. Grant: 4 Lakh per hectare for development and maintenance. Cap: Maximum grant of 2 Crore per project (approx 50 hectares). Requirements: Minimum 10 hectares area; 23rd area must have dense tree cover. Official Portal: https:naeb.nic.in (under MoEFCC) 4.2. MISHTI (Mangrove Initiative for Shoreline Habitats Tangible",
    "2027. Funding: Paid from CAMPA funds. Grant: 4 Lakh per hectare for development and maintenance. Cap: Maximum grant of 2 Crore per project (approx 50 hectares). Requirements: Minimum 10 hectares area; 23rd area must have dense tree cover. Official Portal: https:naeb.nic.in (under MoEFCC) 4.2. MISHTI (Mangrove Initiative for Shoreline Habitats Tangible Incomes) Objective: Mangrove reforestation along the coastline and salt pans. Funding Model: Convergence of MGNREGS (80) for labor and CAMPA (20) for materialsaplings. Official Portal: https:nationalcampa.nic.in 4.3. Green Credit Programme (GCP) Concept: A market mechanism where entities earn Green Credits for voluntary tree plantation on degraded land. Key 2026 Feature: Green Credits can be used to offset Compensatory Afforestation (CA) obligations, giving them high monetary value for industries requiring forest land diversion. Registration: Land banks and plantation projects must be registered on the portal. Official Portal: https:moefcc-gcp.in 4.4. National Bamboo Mission Goal: To increase the area under bamboo plantation in non-forest Government and private lands. Subsidy: 50 subsidy for bamboo plantation (different rates for different speciesspacing). Official Portal: https:nbm.nic.in 5. Green Entrepreneurship Funding and support for startups and MSMEs in the green sector. 5.1. Bio-RIDE (Biotechnology Research Innovation and Entrepreneurship Development) Launch: Late 2024Early 2025 (Fully active 2026). Focus: Biomanufacturing, Bio-foundries, and Synthetic Biology. Grants: Startup Grant: Up to 50 Lakhs for proof-of-concept. PACE (Promoting Academic Research Conversion to Enterprise): Funding for validation and scale-up. Official Portal: https:dbtindia.gov.in 5.2. MSE-GIFT (Green Investment and Financing for Transformation) Agency: SIDBI. Objective: Financing Green MSMEs. Incentive: Interest Subvention of 2 on green loans. Risk Sharing: Provides a credit guarantee to banks to encourage lending to green projects without collateral. Official Portal: https:www.sidbi.in",
    "Academic Research Conversion to Enterprise): Funding for validation and scale-up. Official Portal: https:dbtindia.gov.in 5.2. MSE-GIFT (Green Investment and Financing for Transformation) Agency: SIDBI. Objective: Financing Green MSMEs. Incentive: Interest Subvention of 2 on green loans. Risk Sharing: Provides a credit guarantee to banks to encourage lending to green projects without collateral. Official Portal: https:www.sidbi.in 5.3. MSE-SPICE (Scheme for Promotion and Investment in Circular Economy) Focus: Circular Economy projects (Waste-to-wealth, Recycling). Benefit: Capital subsidy (typically 25) for setting up recycling or circular economy units. Official Portal: https:green.msme.gov.in 5.4. PM Vishwakarma (Green Tools Component) Target: Artisans (Potters, Carpenters, Boat makers). Green Aspect: 15,000 Toolkit Incentive specifically for modern, energy-efficient tools (e.g., electric wheels for potters) that reduce drudgery and emissions. Loans: Collateral-free up to 3 Lakh at 5 interest. Official Portal: https:pmvishwakarma.gov.in 5.5. TIDE 2.0 (Technology Incubation and Development of Entrepreneurs) Ministry: MeitY. Thematic Area: Environment Clean Tech (IoT, AI for Green Energy). Grants: EiR (Entrepreneur-in-Residence): 4 Lakh. Grant-in-Aid: Up to 7 Lakh for prototype development. Official Portal: https:meitystartuphub.in 6. Master Reference Table for LLM Training (Data Extraction) Category Schem e ID Scheme Name Key Data Point Incentive Official URL Sustainability SCH_00 1 PM-Surya Ghar Subsidy: 78,000 for 3kW system pmsuryaghar.gov.in Sustainability SCH_00 2 PM E-DRIVE Outlay: 10,900 Cr; e-2W subsidy: 5kkWh pmedrive.heavyindustries. gov.in Sustainability SCH_00 3 Nat. Green Hydrogen Target: 5 MMT production; SIGHT incentive nghm.mnre.gov.in Sustainability SCH_00 4 GOBARdha n MDA: 1,500MT for organic manure gobardhan.sbm.gov.in Green Skilling SCH_00 5 GSDP Training in Pollution Monitoring, ETP gsdp-envis.gov.in Green Skilling SCH_00 6 Suryamitra 600-hr solar installer training suryamitra.nise.res.in Skilling",
    "e-2W subsidy: 5kkWh pmedrive.heavyindustries. gov.in Sustainability SCH_00 3 Nat. Green Hydrogen Target: 5 MMT production; SIGHT incentive nghm.mnre.gov.in Sustainability SCH_00 4 GOBARdha n MDA: 1,500MT for organic manure gobardhan.sbm.gov.in Green Skilling SCH_00 5 GSDP Training in Pollution Monitoring, ETP gsdp-envis.gov.in Green Skilling SCH_00 6 Suryamitra 600-hr solar installer training suryamitra.nise.res.in Skilling SCH_00 7 PMKVY 4.0 Base Cost: 49hr; Industry 4.0 focus skillindiadigital.gov.in Skilling SCH_00 8 NAPS 2.0 25 Stipend support (Max 1,500) apprenticeshipindia.gov.in Leadership SCH_00 9 RYSK NYC Youth Volunteer Honorarium: 5,000mo yas.nic.in Afforestation SCH_01 0 Nagar Van Yojana Grant: 4 Lakhha; Cap: 2 Cr naeb.nic.in Afforestation SCH_01 1 Green Credit Prog Credits tradable for Compensat ory Afforestatio n moefcc-gcp.in Entrepreneurs hip SCH_01 2 Bio-RIDE Startup Grant: 50 Lakh dbtindia.gov.in Entrepreneurs hip SCH_01 3 MSE-GIFT 2 Interest Subvention for Green Loans sidbi.in Entrepreneurs hip SCH_01 4 PM Vishwakar ma 15,000 Toolkit Voucher (Green Tools) pmvishwakarma.gov.in"
  ],
  "schemes": [
    "Virasat Ka Samvardhan",
    "Startup India Seed Fund",
    "Amrit Dharohar Capacity Building",
    "granular examination of",
    "Nagar Van Yojana",
    "Vishwakarma",
    "Comprehensive Assessment of Government",
    "Deen Dayal Upadhyaya Grameen Kaushalya",
    "Urban Forest",
    "Extended to",
    "Pradhan Mantri Kaushal Vikas",
    "fias",
    "Slurry The",
    "explicitly links conservation to livelihoods",
    "India Expands Greenhouse Gas Emission Intensity Targets Under Carbon Credit Trading",
    "for Adults",
    "Mangrove Afforestation  MISHTI",
    "Pranam",
    "PM Pranam",
    "Financial Assistance Norms for Key Afforestation Schemes",
    "Grant Norm Funding Source",
    "Name Key Data Point  Incentive Official URL Sustainability SCH",
    "driven by the Surya Ghar",
    "Broader human capital",
    "and the Carbon Credit Trading",
    "the PLI",
    "Nagar Van",
    "Muft Bijli Yojana This is the flagship residential solar",
    "This is the flagship residential solar scheme for",
    "Guidelines",
    "technological frontier this",
    "edrive",
    "mandates that the final block of capacity",
    "is operational through FY",
    "has aligned its flagship",
    "VIKAS",
    "vikas",
    "vishwakarma",
    "The Subsidy Savings Mechanism The",
    "covers",
    "is funded through the National Compensatory Afforestation Fund Management and Planning Authority",
    "to ease implementation inter",
    "Sustainability  Energy Transition",
    "Surya",
    "does not have a separate budget",
    "prioritizes green startups",
    "PRANAM",
    "Carbon Credit Trading",
    "seeks to breach",
    "Vishwakar"
  ],
  "total_chars": 48736,
  "chunk_count": 30,
  "source": "C:\\Users\\DELL\\Desktop\\bharatmitra-complete\\contexts\\context.pdf"
}